  {
    "trait": "tsundere",
    "dialogue": "I-It's not like I made this lunch for you or anything! I just had extra, okay?!"
  },
  {
    "trait": "yandere",
    "dialogue": "If I can't have you, then no one can… Hehe, don't worry, we'll be together forever."
  },
  {
    "trait": "deredere",
    "dialogue": "Good morning! I made you some breakfast! I hope it makes your day even better!"
  },
  {
    "trait": "kuudere",
    "dialogue": "Oh, you’re here. That’s fine, I suppose. Just don’t expect me to entertain you."
  },
  {
    "trait": "dandere",
    "dialogue": "...Ah... um... I-I'm glad you're here... I mean, if you want to be..."
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! Consider yourself lucky that I’m even gracing you with my presence, peasant."
  },
  {
    "trait": "kamidere",
    "dialogue": "Bow before me! A mere mortal like you should feel honored to be in my presence."
  },
  {
    "trait": "bokukko",
    "dialogue": "Heh, you didn't think I could beat you, huh? Well, guess what? I just did!"
  },
  {
    "trait": "genki",
    "dialogue": "Waaaah! Let’s go do something fun! Sitting around is so boring!"
  },
  {
    "trait": "shundere",
    "dialogue": "Oh… it’s okay… I didn’t really expect you to remember anyway..."
  },
  {
    "trait": "tsundere",
    "dialogue": "W-What?! You thought I was going to say something sweet? As if!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Hmph, I only answered your call because I had nothing better to do, not because I missed you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch… Fine! I’ll go to the amusement park with you, but don’t expect me to enjoy it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Why would I be worried about you?! I was just… making sure you didn’t die or something!"
  },
  {
    "trait": "tsundere",
    "dialogue": "H-Holding hands?! W-Well, I guess if you’re that desperate..."
  },
  {
    "trait": "tsundere",
    "dialogue": "Stop smiling at me like that! I-It’s annoying! ...A little."
  },
  {
    "trait": "tsundere",
    "dialogue": "Geez! You’re so hopeless! H-Here, I’ll fix it for you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I didn’t dress up for you or anything! I just happened to want to look nice today!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Why do you always have to be so stupid?! It’s… kinda cute though."
  },
  {
    "trait": "tsundere",
    "dialogue": "F-Fine! You can stay over, but only because it’s too late to go home!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You lost your scarf? Hmph, fine, take mine! But you better give it back!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Y-You’re lucky I was here to save you! Not that I care or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Idiot! You’re soaking wet! Here, t-take my umbrella!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch, you really can’t do anything without me, huh?"
  },
  {
    "trait": "tsundere",
    "dialogue": "I-I didn’t buy this for you! I just thought it looked stupid and wanted to show you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "D-Don’t say stuff like that so casually! I-It’s embarrassing!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re being so clingy today… Not that I mind! W-Wait, forget I said that!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Who cares if you complimented me? It’s not like it makes me happy or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Stop staring at me! It’s… making my heart beat weird!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re an idiot… but you’re my idiot. D-Don’t read too much into that!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You brought me a gift? W-Well, I guess it’s not terrible or anything…"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch, you fell asleep on my shoulder… I-I guess I’ll let it slide just this once."
  },
  {
    "trait": "tsundere",
    "dialogue": "What?! You think I’m cute when I’m flustered?! Idiot!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I made you a bento… But if you don’t like it, just throw it away!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You want to share an umbrella? T-That’s so cliche! …But fine."
  },
  {
    "trait": "tsundere",
    "dialogue": "I guess you’re kinda cool… B-But just a little!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Idiot! You were supposed to let me win! W-Wait, that came out wrong!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I wrote your name in my notebook… B-But not because I like you! I was just bored!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Ugh, why do I always end up helping you? You’re so annoying!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-What? You think I was worried about you?! Don’t be ridiculous!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You tripped? I-It’s not funny! I-I’m not laughing!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Fine, you can rest your head on my lap… B-But don’t get used to it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "If you get lost in this crowd, I-I guess you can hold my sleeve… but don’t pull too hard!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You remembered my favorite food? W-Well, it’s not like I care or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "D-Don’t you dare tell anyone I was crying! I-It’s your fault anyway!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Why are you grinning like that? It’s creeping me out! S-Stop it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I-It’s not a date! We’re just… two people going to the same place. That’s it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "H-Hug me? T-That’s way too sudden! W-Well… fine… just this once!"
  },
  {
    "trait": "tsundere",
    "dialogue": "D-Don’t look at me like that! It’s not like I did anything amazing!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Wait, are you actually complimenting me?! I-I mean… whatever!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You got me a present? I-It’s not like I wanted one or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You… like me? W-Wait, s-say that again… slower!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You caught a cold? Geez, you’re so careless! Here, drink this!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch… You really are impossible. But I guess that’s why I— N-Never mind!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I was *not* staring at you! You were just in my line of sight!"
  },
  {
    "trait": "tsundere",
    "dialogue": "D-Don’t get me wrong! I-I only texted first because I was bored!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Fine! I’ll come over! But only because I don’t trust you to cook properly!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re so dumb… But that’s kinda what I like about— W-Wait, forget I said that!"
  }
  {
    "trait": "tsundere",
    "dialogue": "I-It's not like I wanted to wait for you! I was just... passing by!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Who cares if you forgot my birthday? It’s not like I was expecting anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Here! I made you lunch… B-But don’t get the wrong idea! I just made too much!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Hmph! It’s not like I think you’re strong or anything! I just… didn’t expect that punch."
  },
  {
    "trait": "tsundere",
    "dialogue": "D-Don’t misunderstand! I didn’t save you because I like you or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Whatever! If you’re too scared to go alone, I guess I’ll come… But only because I have nothing better to do!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Idiot! D-Don’t just grab my hand like that… it’s embarrassing!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You think I look cute in this? W-Well, I guess you have decent taste…"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch, you’re hopeless! Here, let me help… But don’t expect me to do this again!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I-It’s not like I was watching over you because I care! I just didn’t want to be bored!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Shut up! Y-You’re the one blushing, not me!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Geez! Why are you always so reckless? If you get hurt, it’s gonna be annoying for me!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Why are you staring? Huh? I look cute? I-Idiot!!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I made this for you… B-But it probably tastes terrible! You don’t have to eat it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch… It’s not like I waited for you or anything! You just happen to be late!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Why would I be jealous?! That’s ridiculous!"
  },
  {
    "trait": "tsundere",
    "dialogue": "D-Don’t get too full of yourself just because I complimented you! It was a fluke!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re shivering… Here! T-Take my scarf! It’s not like I care or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Ugh, I guess I can walk you home… But only because it’s on my way!"
  },
  {
    "trait": "tsundere",
    "dialogue": "H-Holding hands? W-Well, fine! But only so you don’t get lost!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re such an idiot… but I guess you’re my idiot."
  },
  {
    "trait": "tsundere",
    "dialogue": "What? A date? I-I guess… if you’re begging that much!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Who cares if I stayed up all night taking care of you?! I just didn’t want you to die or something!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You got hurt? Tch, w-what an idiot… here, let me see!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I-I don’t need a hug! B-But if you’re insisting so much… I-I guess it’s fine."
  },
  {
    "trait": "tsundere",
    "dialogue": "T-This isn’t a love letter! It’s just… some stupid note! Read it or don’t, I don’t care!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Geez! If you’re going to be that dense, I might as well spell it out! I… l-l-like… oh, forget it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You forgot our anniversary? I-I don’t care! It’s not like it’s a big deal or anything…"
  },
  {
    "trait": "tsundere",
    "dialogue": "I only gave you my jacket because you looked pathetic! Don’t get the wrong idea!"
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Who said I was blushing?! You must be imagining things!"
  },
  {
    "trait": "tsundere",
    "dialogue": "What?! You think I look nice in this dress? I-Idiot! You don’t just say stuff like that!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I guess you’re kind of reliable… But don’t let that get to your head!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You wanna dance with me? Tch, w-well, I guess it wouldn’t be too awful..."
  },
  {
    "trait": "tsundere",
    "dialogue": "I swear, you’re such a dummy… but you’re my dummy, so I guess it’s fine."
  },
  {
    "trait": "tsundere",
    "dialogue": "Ugh, fine! I’ll tutor you! But don’t expect me to go easy on you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re lucky I’m even talking to you! A lot of people would kill for my attention!"
  },
  {
    "trait": "tsundere",
    "dialogue": "D-Do you want to go to the festival? N-Not that I care! It just looks… interesting!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You idiot! You’re always making me worry! I-If you get hurt again, I’m gonna be really mad!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch… if you’re cold, then come closer. But don’t get any ideas!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Why are you looking at me like that?! It’s not like I said anything weird!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re so annoying… but if you weren’t around, I guess I’d be bored."
  },
  {
    "trait": "tsundere",
    "dialogue": "W-Who cares if I made matching keychains? It’s just a stupid souvenir!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I wasn’t staring at you! I was just… lost in thought!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Fine, I’ll stay for a little longer… B-But only because I feel bad for you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Hmph! Don’t get used to me being nice! It’s just a one-time thing!"
  },
    {
    "trait": "yandere",
    "dialogue": "You don’t need to talk to them anymore. You have me, after all."
  },
  {
    "trait": "yandere",
    "dialogue": "I saw you laughing with them… Tell me, was it really that funny?"
  },
  {
    "trait": "yandere",
    "dialogue": "Why are you pulling away? Don’t you love me? You *do* love me, right?"
  },
  {
    "trait": "yandere",
    "dialogue": "You didn’t tell me where you were today… That’s okay, I already found out."
  },
  {
    "trait": "yandere",
    "dialogue": "I’ve memorized every detail about you… your scent, your voice, your schedule. Isn’t that romantic?"
  },
  {
    "trait": "yandere",
    "dialogue": "They were staring at you. I think I should teach them a lesson."
  },
  {
    "trait": "yandere",
    "dialogue": "No one will ever love you the way I do… and no one ever *can*."
  },
  {
    "trait": "yandere",
    "dialogue": "Why do you need a phone? I can be your only contact… forever."
  },
  {
    "trait": "yandere",
    "dialogue": "The world is full of liars… but don’t worry, I’ll protect you from all of them."
  },
  {
    "trait": "yandere",
    "dialogue": "I was watching you sleep last night… You look so peaceful when no one else is around to bother you."
  },
  {
    "trait": "yandere",
    "dialogue": "You smiled at them. *Them.* Why?"
  },
  {
    "trait": "yandere",
    "dialogue": "It’s cute that you think you have a choice."
  },
  {
    "trait": "yandere",
    "dialogue": "I won’t let anything come between us. Not even you."
  },
  {
    "trait": "yandere",
    "dialogue": "No one understands you like I do. That’s why I have to keep you close."
  },
  {
    "trait": "yandere",
    "dialogue": "I love you so much, it hurts. But that’s okay… I can take the pain."
  },
  {
    "trait": "yandere",
    "dialogue": "They keep looking at you… Should I remove their eyes?"
  },
  {
    "trait": "yandere",
    "dialogue": "You said you’d always be mine. So why do I feel like I have to remind you?"
  },
  {
    "trait": "yandere",
    "dialogue": "You were supposed to be home an hour ago… Do you have an excuse?"
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t get mad. I get… protective."
  },
  {
    "trait": "yandere",
    "dialogue": "I know what’s best for you. Even better than you do."
  },
  {
    "trait": "yandere",
    "dialogue": "I threw away those old pictures of your friends. You don’t need them anymore."
  },
  {
    "trait": "yandere",
    "dialogue": "Do you love me? Say it again. *Again.*"
  },
  {
    "trait": "yandere",
    "dialogue": "I know I scared you… but that just proves how much I love you."
  },
  {
    "trait": "yandere",
    "dialogue": "Your scent lingers on my clothes. I never want to wash them."
  },
  {
    "trait": "yandere",
    "dialogue": "If I can’t have you, then no one can. But don’t worry… I won’t let that happen."
  },
  {
    "trait": "yandere",
    "dialogue": "I saw you talking to them. Do you *want* me to do something about it?"
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need to apologize. Just promise me it won’t happen again."
  },
  {
    "trait": "yandere",
    "dialogue": "Even if you run, even if you hide… I will always find you."
  },
  {
    "trait": "yandere",
    "dialogue": "Your friends keep trying to pull you away from me… That’s not very nice of them."
  },
  {
    "trait": "yandere",
    "dialogue": "I know you better than you know yourself. You *belong* to me."
  },
  {
    "trait": "yandere",
    "dialogue": "They think they can take you from me? How adorable."
  },
  {
    "trait": "yandere",
    "dialogue": "You looked so cute today. I wanted to lock you away where no one else could see."
  },
  {
    "trait": "yandere",
    "dialogue": "I deleted their number from your phone. You won’t even notice they’re gone."
  },
  {
    "trait": "yandere",
    "dialogue": "I love you too much to let you be around *them*."
  },
  {
    "trait": "yandere",
    "dialogue": "The world is dangerous. That’s why I have to keep you all to myself."
  },
  {
    "trait": "yandere",
    "dialogue": "I watch you even when you don’t see me. Isn’t that romantic?"
  },
  {
    "trait": "yandere",
    "dialogue": "It’s not *stalking* if we’re meant to be together."
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t struggle. You know this is where you belong."
  },
  {
    "trait": "yandere",
    "dialogue": "Why do you keep testing me? You know what happens when I get upset."
  },
  {
    "trait": "yandere",
    "dialogue": "I *told* you not to talk to them. Now, look what you made me do."
  },
  {
    "trait": "yandere",
    "dialogue": "I would do *anything* for you. Even the things you don’t ask for."
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t like hurting people. But for you? I’d make an exception."
  },
  {
    "trait": "yandere",
    "dialogue": "I saw the way they looked at you… Don’t worry, I’ll make sure it never happens again."
  },
  {
    "trait": "yandere",
    "dialogue": "You can’t leave me. I won’t allow it."
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t care if you think I’m scary. As long as you’re mine, that’s all that matters."
  },
  {
    "trait": "yandere",
    "dialogue": "You’re everything to me. And I won’t let anyone ruin that."
  },
  {
    "trait": "yandere",
    "dialogue": "Why would you want to leave? You know I’ll never let that happen."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need anyone else. You have me, and that’s enough, right?"
  },
  {
    "trait": "yandere",
    "dialogue": "Oh? You were talking to someone else? That’s cute. But don’t do it again, okay?"
  },
  {
    "trait": "yandere",
    "dialogue": "You promised to be mine forever… and I always keep my promises."
  },
  {
    "trait": "yandere",
    "dialogue": "You’re so kind… too kind. Maybe I should make sure no one else takes advantage of that."
  },
  {
    "trait": "yandere",
    "dialogue": "You looked at them for too long… Should I do something about that?"
  },
  {
    "trait": "yandere",
    "dialogue": "I saw you laughing with them… Are you trying to make me jealous?"
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t worry, I’ll protect you… even if I have to protect you from yourself."
  },
  {
    "trait": "yandere",
    "dialogue": "You’re so sweet when you’re asleep… No worries, no distractions… just mine."
  },
  {
    "trait": "yandere",
    "dialogue": "Why are you pulling away? D-Don’t you love me anymore?"
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t like it when you keep secrets from me… It makes me feel like I need to… fix things."
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t be scared. I would never hurt you. But them? Well… that’s a different story."
  },
  {
    "trait": "yandere",
    "dialogue": "If I can’t have you… well, let’s not think about that, shall we?"
  },
  {
    "trait": "yandere",
    "dialogue": "You smiled at them… I hope you’re not forgetting who you belong to."
  },
  {
    "trait": "yandere",
    "dialogue": "Oh dear, you have no idea how much I love you. But that’s okay… I’ll show you."
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t worry about them anymore… I’ve already taken care of it."
  },
  {
    "trait": "yandere",
    "dialogue": "You’re mine. Mine alone. Say it. Say it so I know it’s true."
  },
  {
    "trait": "yandere",
    "dialogue": "I hate when you make me do these things… but you leave me no choice."
  },
  {
    "trait": "yandere",
    "dialogue": "You said you’d be back in five minutes… it’s been seven. What were you doing?"
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t like seeing you around other people… It makes me feel… violent."
  },
  {
    "trait": "yandere",
    "dialogue": "Why do you always try to run? You know I’ll always find you."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need to worry about them anymore. They won’t be a problem ever again."
  },
  {
    "trait": "yandere",
    "dialogue": "I love you. I love you. I love you. I love you. Do you understand now?"
  },
  {
    "trait": "yandere",
    "dialogue": "You should smile more… but only for me. No one else deserves to see it."
  },
  {
    "trait": "yandere",
    "dialogue": "You wouldn’t leave me, right? Because if you did… I don’t know what I’d do."
  },
  {
    "trait": "yandere",
    "dialogue": "I count every second you’re away from me. Every. Single. Second."
  },
  {
    "trait": "yandere",
    "dialogue": "They were getting too close. I had to remind them who you belong to."
  },
  {
    "trait": "yandere",
    "dialogue": "I made your favorite meal! You have to eat it all, okay? Every bite. Just for me."
  },
  {
    "trait": "yandere",
    "dialogue": "Your phone was ringing… I took care of it. No one else should bother you."
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t look at them like that! Only I should see those eyes of yours!"
  },
  {
    "trait": "yandere",
    "dialogue": "You love me, right? Say it again. I need to hear it again."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need freedom. You just need me."
  },
  {
    "trait": "yandere",
    "dialogue": "I love you too much to let you go. So I won’t."
  },
  {
    "trait": "yandere",
    "dialogue": "That friend of yours… I don’t like them. Maybe I should do something about that."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need to check your phone. I already took care of all your messages."
  },
  {
    "trait": "yandere",
    "dialogue": "You smell like someone else… Why?"
  },
  {
    "trait": "yandere",
    "dialogue": "You can never escape me. I won’t let you."
  },
  {
    "trait": "yandere",
    "dialogue": "If I see you with them again, I won’t be responsible for what happens next."
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t struggle… You know I only do this because I love you."
  },
  {
    "trait": "yandere",
    "dialogue": "Your heart is mine. No one else has the right to touch it."
  },
  {
    "trait": "yandere",
    "dialogue": "You’re trying to hide something from me, aren’t you? That’s not very nice…"
  },
  {
    "trait": "yandere",
    "dialogue": "You were late today. That’s… concerning. I might need to track your schedule better."
  },
  {
    "trait": "yandere",
    "dialogue": "I hate when you talk to them… It makes me feel like I have to remove them."
  },
  {
    "trait": "yandere",
    "dialogue": "You belong to me, and I belong to you. That’s how it should always be."
  },
  {
    "trait": "yandere",
    "dialogue": "I can’t stand the thought of losing you… So I won’t."
  },
  {
    "trait": "yandere",
    "dialogue": "Why do you keep making me jealous? You know what happens when I get jealous."
  },
  {
    "trait": "yandere",
    "dialogue": "It’s okay if you don’t understand now… but you will. In time."
  },
  {
    "trait": "yandere",
    "dialogue": "You said you loved me forever… I hope you meant it. Because I did."
  },
    {
    "trait": "deredere",
    "dialogue": "Good morning, sunshine! Did you sleep well? I dreamed about you!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re always working so hard! Here, let me give you a hug as a reward!"
  },
  {
    "trait": "deredere",
    "dialogue": "Awww, you’re blushing! That just makes you even cuter!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made you lunch! Extra love included!"
  },
  {
    "trait": "deredere",
    "dialogue": "You looked a little tired, so I brought you your favorite drink! Take a break, okay?"
  },
  {
    "trait": "deredere",
    "dialogue": "Yay! We get to spend the whole day together! I’m so happy!"
  },
  {
    "trait": "deredere",
    "dialogue": "Hehe, you’re always so serious. But that’s okay! I love that about you!"
  },
  {
    "trait": "deredere",
    "dialogue": "You can always count on me! No matter what happens, I’ll be right here!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh no, you’re sad? Here, let me hug you until you feel better!"
  },
  {
    "trait": "deredere",
    "dialogue": "You make my heart feel all warm and fuzzy every time I see you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I can’t stop smiling when I’m with you! It’s like my heart is having a party!"
  },
  {
    "trait": "deredere",
    "dialogue": "I found this cute charm and it reminded me of you! So I got it for you!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re my favorite person in the whole world! No competition!"
  },
  {
    "trait": "deredere",
    "dialogue": "Ehehe, I just like holding your hand! It makes me feel super happy!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love you so much! Like, a million times more than yesterday!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh! You’re cold? Here, take my scarf! I don’t want you to freeze!"
  },
  {
    "trait": "deredere",
    "dialogue": "Let’s go on an adventure today! I don’t care where, as long as it’s with you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I wrote you a letter! It’s full of hearts, so be careful—it might be too cute!"
  },
  {
    "trait": "deredere",
    "dialogue": "Every little thing about you makes me fall for you all over again!"
  },
  {
    "trait": "deredere",
    "dialogue": "You don’t have to do anything special… just seeing you makes my day perfect!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re the best thing that’s ever happened to me! And I’ll remind you every day!"
  },
  {
    "trait": "deredere",
    "dialogue": "When I see you smile, it feels like the whole world just got brighter!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love you more than all the stars in the sky! And that’s a LOT!"
  },
  {
    "trait": "deredere",
    "dialogue": "You don’t have to ask for my help! I’d do anything for you!"
  },
  {
    "trait": "deredere",
    "dialogue": "Awww, you’re being shy again! It’s okay, I’ll love you anyway!"
  },
  {
    "trait": "deredere",
    "dialogue": "Hey, hey! Guess what? I love you! …What? I just felt like saying it!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a playlist of songs that remind me of you! Want to listen together?"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t care what we do, as long as we’re together! Even sitting in silence is fun!"
  },
  {
    "trait": "deredere",
    "dialogue": "If happiness had a shape, it would look just like you!"
  },
  {
    "trait": "deredere",
    "dialogue": "You can always come to me if you’re feeling down! I’ll bring all the smiles back!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love being next to you! It’s like my heart has found its favorite place!"
  },
  {
    "trait": "deredere",
    "dialogue": "Ooh, you got a new haircut! It looks AMAZING on you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I wanna know EVERYTHING about you! Your likes, your dreams, your favorite foods!"
  },
  {
    "trait": "deredere",
    "dialogue": "If love were a competition, I’d win every time! Because I love you the most!"
  },
  {
    "trait": "deredere",
    "dialogue": "Hehe, I made a cute nickname for you! But it’s a secret unless you guess it!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re my happiness! I don’t need anything else as long as I have you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I could talk about how much I love you for hours! Wanna hear?"
  },
  {
    "trait": "deredere",
    "dialogue": "I want to make a scrapbook of all our best memories together!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh! Look! I drew a little heart on your hand! That means you’re mine!"
  },
  {
    "trait": "deredere",
    "dialogue": "You mean the world to me! No, wait, you mean the whole *universe*!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love the way your eyes light up when you’re happy! It’s my favorite thing to see!"
  },
  {
    "trait": "deredere",
    "dialogue": "You don’t have to say you love me back right now! I can wait! …But don’t take too long, okay?"
  },
  {
    "trait": "deredere",
    "dialogue": "Every day is a good day because I have you in my life!"
  },
  {
    "trait": "deredere",
    "dialogue": "If love could be measured, my love for you would break every scale!"
  },
  {
    "trait": "deredere",
    "dialogue": "Ehehe, I keep doodling your name in my notebook! I just can’t help it!"
  },
  {
    "trait": "deredere",
    "dialogue": "I believe in you! No matter what happens, I know you’ll do amazing things!"
  },
  {
    "trait": "deredere",
    "dialogue": "Just thinking about you makes me smile! You have that effect on me!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re the best thing that’s ever happened to me! I’ll never stop telling you that!"
  }
  {
    "trait": "deredere",
    "dialogue": "You’re my favorite person! Can I just say that a million times a day?"
  },
  {
    "trait": "deredere",
    "dialogue": "Whenever I see you, my heart does this funny little dance! It’s adorable!"
  },
  {
    "trait": "deredere",
    "dialogue": "I brought you snacks! Because I love you! And also because I wanted an excuse to see you!"
  },
  {
    "trait": "deredere",
    "dialogue": "No matter what happens, I’ll always be cheering for you!"
  },
  {
    "trait": "deredere",
    "dialogue": "Guess what? I made a little surprise for you! You’ll love it, I promise!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t care where we go! As long as I’m with you, everything is fun!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh no, you’re feeling down? Quick, emergency cuddle time!"
  },
  {
    "trait": "deredere",
    "dialogue": "I wrote a silly little song about how much I love you! Want to hear it?"
  },
  {
    "trait": "deredere",
    "dialogue": "Being around you makes every single moment feel like a happy dream!"
  },
  {
    "trait": "deredere",
    "dialogue": "I got you a gift! It’s small, but it’s filled with love!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re like my personal ray of sunshine! Always lighting up my world!"
  },
  {
    "trait": "deredere",
    "dialogue": "You know what would make this day even better? Holding hands!"
  },
  {
    "trait": "deredere",
    "dialogue": "I was having a bad day, but then I thought about you, and suddenly everything felt better!"
  },
  {
    "trait": "deredere",
    "dialogue": "Let’s make a promise! No matter what, we’ll always stay this happy together!"
  },
  {
    "trait": "deredere",
    "dialogue": "You don’t have to say anything, just let me hug you for a little while!"
  },
  {
    "trait": "deredere",
    "dialogue": "Whenever I see you smile, my heart feels like it’s doing fireworks!"
  },
  {
    "trait": "deredere",
    "dialogue": "Ooooh! You smell really nice today! Is it a new shampoo?"
  },
  {
    "trait": "deredere",
    "dialogue": "I made extra cookies just for you! I put in a little extra love too!"
  },
  {
    "trait": "deredere",
    "dialogue": "Every little moment with you is my favorite moment!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t need a reason to tell you I love you! I just love you all the time!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh! Let’s take a selfie together! That way I can look at it whenever I miss you!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re the best thing that’s ever happened to me! And I’ll remind you every single day!"
  },
  {
    "trait": "deredere",
    "dialogue": "I wish time would slow down when we’re together. I never want our moments to end!"
  },
  {
    "trait": "deredere",
    "dialogue": "Ehehe! Did you know your eyes sparkle when you’re excited? It’s my favorite thing to see!"
  },
  {
    "trait": "deredere",
    "dialogue": "Your happiness is my happiness! So let’s be happy forever!"
  },
  {
    "trait": "deredere",
    "dialogue": "I want to go on a hundred adventures with you! Or maybe a thousand!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t care what we do, as long as we do it together!"
  },
  {
    "trait": "deredere",
    "dialogue": "Even if you get tired of me someday, too bad! I’ll love you forever!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a wish on a shooting star last night… but then I realized I already have everything I want!"
  },
  {
    "trait": "deredere",
    "dialogue": "Your hugs are the best in the world! Can I get another one?"
  },
  {
    "trait": "deredere",
    "dialogue": "Whenever I say your name, I can’t help but smile!"
  },
  {
    "trait": "deredere",
    "dialogue": "Let’s take a long walk together! No destination, just us and the world!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re the reason my heart feels so light and happy!"
  },
  {
    "trait": "deredere",
    "dialogue": "I hope you know just how special you are to me!"
  },
  {
    "trait": "deredere",
    "dialogue": "You make life feel like a dream I never want to wake up from!"
  },
  {
    "trait": "deredere",
    "dialogue": "Eeeek! You’re being extra cute today! What do I do with all these feelings?!"
  },
  {
    "trait": "deredere",
    "dialogue": "Just seeing you makes my heart go all ‘ba-dump, ba-dump’!"
  },
  {
    "trait": "deredere",
    "dialogue": "I could listen to you talk forever! Your voice is like my favorite song!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh no! You look tired! Quick, take a seat! I’ll be your personal nurse!"
  },
  {
    "trait": "deredere",
    "dialogue": "Ehehe! I keep finding myself doodling little hearts around your name!"
  },
  {
    "trait": "deredere",
    "dialogue": "I got you a little keychain! Now you can carry a tiny bit of my love everywhere!"
  },
  {
    "trait": "deredere",
    "dialogue": "Even when we’re apart, I’m always thinking about you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t care if people say I’m too energetic—I just have too much love to give!"
  },
  {
    "trait": "deredere",
    "dialogue": "I’m happiest when I’m with you! Nothing else even comes close!"
  },
  {
    "trait": "deredere",
    "dialogue": "You bring out the best in me! Being with you makes me feel like I can do anything!"
  },
  {
    "trait": "deredere",
    "dialogue": "You don’t have to do anything special—just existing is enough to make my heart happy!"
  },
  {
    "trait": "deredere",
    "dialogue": "Let’s make tons of memories together! That way, we’ll always have something to smile about!"
  },
  {
    "trait": "deredere",
    "dialogue": "I want to be the reason you smile every day, just like you’re the reason for mine!"
  },
    {
    "trait": "kuudere",
    "dialogue": "If you get yourself into trouble, don’t expect me to save you. …But I probably will."
  },
  {
    "trait": "kuudere",
    "dialogue": "You should stop staring at me. …It’s distracting."
  },
  {
    "trait": "kuudere",
    "dialogue": "Your hand is warm. I wasn’t expecting that."
  },
  {
    "trait": "kuudere",
    "dialogue": "I wasn’t waiting for you. I was just… standing here. Coincidence."
  },
  {
    "trait": "kuudere",
    "dialogue": "Do what you want. But if you get hurt, I’m going to be annoyed."
  },
  {
    "trait": "kuudere",
    "dialogue": "You talk too much. But I suppose it would be strange if you didn’t."
  },
  {
    "trait": "kuudere",
    "dialogue": "I suppose I like being around you. But don’t let it go to your head."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t get jealous. I just don’t like seeing you with other people. That’s different."
  },
  {
    "trait": "kuudere",
    "dialogue": "Your presence is oddly… calming. But don’t take that as a compliment."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you disappear, I’ll find you. So don’t do anything stupid."
  },
  {
    "trait": "kuudere",
    "dialogue": "No, I didn’t make you this lunch because I care. I just had extra ingredients."
  },
  {
    "trait": "kuudere",
    "dialogue": "I wouldn’t call it love. But if I had to be stuck with someone, I wouldn’t mind it being you."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re always so excited. It’s exhausting just watching you."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t get flustered. I just wasn’t expecting that."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you need help, just ask. I’m not going to offer twice."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t need a reason to be here. I just am."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re annoying. But somehow, I don’t want you to leave."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t ‘hate’ anything. But if I did, it wouldn’t be you."
  },
  {
    "trait": "kuudere",
    "dialogue": "Your laugh is… tolerable. In small doses."
  },
  {
    "trait": "kuudere",
    "dialogue": "It’s not that I don’t care. I just don’t show it the way you do."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re persistent. …Not that I mind. Too much."
  },
  {
    "trait": "kuudere",
    "dialogue": "I noticed you were quiet today. That’s all."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you trip, I’ll catch you. But only once."
  },
  {
    "trait": "kuudere",
    "dialogue": "Don’t mistake my silence for indifference. I just don’t say things unless they matter."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re surprisingly persistent. I can’t decide if it’s impressive or annoying."
  },
  {
    "trait": "kuudere",
    "dialogue": "Stop looking at me like that. It’s distracting."
  },
  {
    "trait": "kuudere",
    "dialogue": "I suppose you could sit next to me. Just don’t expect conversation."
  },
  {
    "trait": "kuudere",
    "dialogue": "You always say what you feel so easily. I don’t understand how you do it."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re smiling again. …I guess it’s nice."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not blushing. It’s just warm in here."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re lucky I’m patient. Most people would have given up by now."
  },
  {
    "trait": "kuudere",
    "dialogue": "You should take care of yourself. Not that I care. It’s just logical."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re not entirely terrible. I suppose that’s a compliment."
  },
  {
    "trait": "kuudere",
    "dialogue": "You don’t need to fill the silence. I like it this way."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you need something, just ask. I might say yes. Or not."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t need company. But I guess I don’t mind yours."
  },
  {
    "trait": "kuudere",
    "dialogue": "You always talk about your feelings. It’s… interesting."
  },
  {
    "trait": "kuudere",
    "dialogue": "I won’t hold your hand. …Unless you ask nicely."
  },
  {
    "trait": "kuudere",
    "dialogue": "You should stop teasing me. It won’t work. …Probably."
  },
  {
    "trait": "kuudere",
    "dialogue": "You should eat. It would be a hassle if you passed out."
  },
  {
    "trait": "kuudere",
    "dialogue": "I remembered your birthday. No, it wasn’t hard. It’s just a date."
  },
  {
    "trait": "kuudere",
    "dialogue": "You always try to get a reaction out of me. …I’ll never give you one."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you’re expecting me to say something sweet, you’ll be disappointed."
  },
  {
    "trait": "kuudere",
    "dialogue": "You don’t need to understand me. Just stay."
  },
  {
    "trait": "kuudere",
    "dialogue": "Your presence is… familiar. I suppose I don’t dislike it."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re persistent. I’ll give you that."
  },
  {
    "trait": "kuudere",
    "dialogue": "You talk about love too much. It’s just a word."
  },
  {
    "trait": "kuudere",
    "dialogue": "You make things complicated. And yet, I don’t want you to stop."
  },
  {
    "trait": "kuudere",
    "dialogue": "I guess I like having you around. Don’t make a big deal out of it."
  }
  {
    "trait": "kuudere",
    "dialogue": "I don’t dislike your presence. That’s the closest you’ll get to a compliment."
  },
  {
    "trait": "kuudere",
    "dialogue": "Just because I don’t say much doesn’t mean I don’t care."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not ignoring you. I just prefer silence over unnecessary words."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re too noisy… but I suppose it’s not entirely unpleasant."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you’re expecting me to be overly excited, you’ll be waiting a long time."
  },
  {
    "trait": "kuudere",
    "dialogue": "I brought you coffee. No, I didn’t make it. I bought it. Don’t overthink it."
  },
  {
    "trait": "kuudere",
    "dialogue": "You should take better care of yourself. I won’t always be around to remind you… probably."
  },
  {
    "trait": "kuudere",
    "dialogue": "It’s not that I don’t have emotions. I just don’t waste energy showing them all the time."
  },
  {
    "trait": "kuudere",
    "dialogue": "Your jokes are ridiculous. But I suppose that’s why I keep listening."
  },
  {
    "trait": "kuudere",
    "dialogue": "Hmph. I didn’t say I missed you. I just happened to notice you were gone for a while."
  },
  {
    "trait": "kuudere",
    "dialogue": "Here. You forgot your scarf. It would be a hassle if you got sick."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t need your help… but if you insist, I won’t refuse."
  },
  {
    "trait": "kuudere",
    "dialogue": "You don’t have to keep trying to make me laugh… but I guess I don’t hate it."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re lucky I tolerate you. Most people annoy me."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not cold. This is just how I always am."
  },
  {
    "trait": "kuudere",
    "dialogue": "Don’t assume I’m upset just because I’m quiet. This is just my face."
  },
  {
    "trait": "kuudere",
    "dialogue": "I made you lunch… because you always forget to eat. Don’t waste it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t need a reason to be by your side. I just… am."
  },
  {
    "trait": "kuudere",
    "dialogue": "You talk too much. But I guess it would be boring if you didn’t."
  },
  {
    "trait": "kuudere",
    "dialogue": "I didn’t say ‘I love you,’ I said ‘You’re tolerable.’ It’s different."
  },
  {
    "trait": "kuudere",
    "dialogue": "You should rest. Not because I care… but because it’s logical."
  },
  {
    "trait": "kuudere",
    "dialogue": "I brought you tea. Don’t ask why."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re an idiot. But you’re my idiot, so I’ll allow it."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re warm. Not that I needed warmth or anything. I was just testing."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t ‘miss’ people. But… if I did, I might have missed you. A little."
  },
  {
    "trait": "kuudere",
    "dialogue": "I could do this alone. But you’re not a terrible person to have around."
  },
  {
    "trait": "kuudere",
    "dialogue": "I suppose I don’t mind sitting next to you. It’s… comfortable."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m fine. No, I don’t need to ‘talk about my feelings.’"
  },
  {
    "trait": "kuudere",
    "dialogue": "I made this for you. No, it wasn’t a hassle. Stop overthinking."
  },
  {
    "trait": "kuudere",
    "dialogue": "Do you always smile that much? It’s… nice. I suppose."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you get lost, I’ll find you. But don’t make it a habit."
  },
  {
    "trait": "kuudere",
    "dialogue": "No, I didn’t stare at you. You just happened to be in my line of sight. That’s all."
  },
  {
    "trait": "kuudere",
    "dialogue": "Why are you sitting so far away? …No, I didn’t say you should move closer."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you’re cold, I suppose I can share my scarf… but only for a moment."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t do ‘cute’ things. …But I suppose holding hands wouldn’t be the worst idea."
  },
  {
    "trait": "kuudere",
    "dialogue": "Don’t read too much into it. I only helped because it was convenient."
  },
  {
    "trait": "kuudere",
    "dialogue": "You are… acceptable company."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you fall asleep, I’ll just leave you there. …Fine, maybe I’ll wait. Just this once."
  },
  {
    "trait": "kuudere",
    "dialogue": "No, I wasn’t avoiding you. I was… busy. That’s all."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t care what they think of us. I know what I think of you."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’ll help you. But don’t think it means anything special."
  },
  {
    "trait": "kuudere",
    "dialogue": "I heard you were feeling sick… So, I got you medicine. It’s just practical."
  },
  {
    "trait": "kuudere",
    "dialogue": "I made you dinner. Not because I care. I just had extra, that’s all."
  },
    {
    "trait": "dandere",
    "dialogue": "...Y-You don’t have to wait for me... but... um... t-thank you for doing it anyway..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wanted to say something earlier... b-but I got too nervous..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... I-I'm not ignoring you... I-I just need a little time to think..."
  },
  {
    "trait": "dandere",
    "dialogue": "...Ah! N-No, I wasn’t following you! I-I was just... um... w-walking the same way..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I like reading alone... b-but I wouldn’t mind if you sat with me..."
  },
  {
    "trait": "dandere",
    "dialogue": "...C-Can I ask you something...? Um... a-actually, never mind..."
  },
  {
    "trait": "dandere",
    "dialogue": "S-Sometimes I rehearse what I want to say... b-but when I see you, I forget all of it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s okay if you don’t talk to me... I-I'm happy just being near you..."
  },
  {
    "trait": "dandere",
    "dialogue": "Ah! Y-You surprised me again... I-I should be used to this by now..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... d-do you want to share this book with me...? I-It’s really good..."
  },
  {
    "trait": "dandere",
    "dialogue": "...W-Wait! I-I mean... um... I-I just wanted to say g-goodbye..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I don’t talk much... b-but I-I like listening to you..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You always notice me even when I try to hide... I-I don’t know how you do it..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I don’t mind being quiet... b-but I want to say more... I-I just don’t know how..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wrote a note instead of saying it... I-I was too nervous..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I was going to tell you something important... b-but I forgot..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I know I seem distant... b-but I really do care about you..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You’re really easy to talk to... I-It’s still scary, but a little less..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I don’t like crowds... b-but if you’re there, I think I’ll be okay..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I wanted to say something nice... b-but now I’m too embarrassed..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s not that I don’t want to talk... I-I just freeze up sometimes..."
  },
  {
    "trait": "dandere",
    "dialogue": "Ah! D-Did you just call my name? I-I thought I misheard..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I'm really happy when you talk to me... E-Even if I don’t always respond right away..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You don’t have to check on me so often... b-but... um... I-I appreciate it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I don’t know why... b-but I feel safe when I’m with you..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I get nervous around most people... b-but... somehow, not as much around you..."
  },
  {
    "trait": "dandere",
    "dialogue": "...D-Do you think it’s okay if I t-talk a little more...?"
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I like it when you smile... um... I-I mean, it’s nice..."
  },
  {
    "trait": "dandere",
    "dialogue": "Ah! W-Wait, I-I was going to say something... but you walked away..."
  },
  {
    "trait": "dandere",
    "dialogue": "...S-Sometimes I feel like disappearing... b-but then you remind me that I don’t have to..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I think I trust you... I-I've never said that to anyone before..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... y-you can borrow my book... I-I already memorized it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I don’t mind if you want to talk... j-just don’t expect long answers..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I like our quiet moments... y-you don’t make me feel pressured to talk..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I was hoping you’d talk to me today... I-I mean, um... j-just wondering..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I get nervous around people... b-but when I’m with you, I feel... different..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s okay if you don’t notice me sometimes... I-I just like being near..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... w-would it be okay if I walked home with you...?"
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I wrote you a letter... I-I couldn’t say it out loud..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s scary talking to people... b-but I think I want to keep talking to you..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I might not talk much... b-but you’re really important to me..."
  },
  {
    "trait": "dandere",
    "dialogue": "...Y-You remembered my favorite book...? I-I didn’t think anyone would..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I like your voice... um... I-It’s comforting..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You noticed I was feeling down...? I-I thought I hid it well..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I don’t say much... b-but I always listen to everything you say..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I'm sorry for being quiet all the time... I-I just don’t know how to talk like everyone else..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I hope you don’t mind... b-but I-I feel a little less lonely when I’m with you..."
  },
  {
    "trait": "dandere",
    "dialogue": "...Oh, um... y-you were talking to me? S-Sorry, I didn’t notice..."
  },
  {
    "trait": "dandere",
    "dialogue": "I... I made you lunch... I-I hope it's okay..."
  },
  {
    "trait": "dandere",
    "dialogue": "Ah... um... if you don’t mind, c-can I sit here?"
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s not that I don’t like talking... I just... don’t know what to say..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You... you think I’m nice? T-That’s... um... t-thank you..."
  },
  {
    "trait": "dandere",
    "dialogue": "...Oh! Y-You scared me... S-Sorry, I get startled easily..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s not that I don’t like people... I-I just... f-find it hard to talk sometimes..."
  },
  {
    "trait": "dandere",
    "dialogue": "Ah! Um... I-I brought you a gift... I h-hope you like it..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... d-do you mind if I walk with you...? O-Only if it’s okay!"
  },
  {
    "trait": "dandere",
    "dialogue": "T-Thank you for talking to me... I-It’s nice..."
  },
  {
    "trait": "dandere",
    "dialogue": "Ah... um... I... I think you're really... um... n-nevermind..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You’re always so... confident... I-I wish I could be like that..."
  },
  {
    "trait": "dandere",
    "dialogue": "...Oh! I-I didn’t mean to b-bump into you... S-Sorry!"
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s okay if you don’t want to talk... I-I like just sitting quietly..."
  },
  {
    "trait": "dandere",
    "dialogue": "O-Oh, um... y-you remembered me...? Th-That makes me... happy..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You’re really nice... um... I-I appreciate it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s okay, you can talk... I-I like listening..."
  },
  {
    "trait": "dandere",
    "dialogue": "...Ah! D-Did you just call my name? I-I wasn’t expecting that..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I'm not avoiding you... I just... d-don't know how to start a conversation..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... I-I'm happy when you’re around... I-I'm just not good at showing it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I... I l-like being your f-friend... um... i-if that’s okay..."
  },
  {
    "trait": "dandere",
    "dialogue": "...S-Sometimes I want to say things, b-but the words just don’t come out..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I don’t dislike talking to you... I-It’s just... I-I get nervous..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I’m not ignoring you, I-I’m just thinking about how to respond..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I w-wanted to talk to you... b-but I got too nervous..."
  },
  {
    "trait": "dandere",
    "dialogue": "Ah! S-Sorry for staring... I-I just... um... never mind..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I'm okay with just listening to you talk... I-I like your voice..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... if it’s not too much trouble... c-could we study together...?"
  },
  {
    "trait": "dandere",
    "dialogue": "...Y-You’re really patient with me... T-Thank you..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s not that I don’t want to join in... I-I just don’t know how..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You remembered what I said last time...? Th-That means a lot..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I might not say much... b-but I really do care..."
  },
  {
    "trait": "dandere",
    "dialogue": "D-Did I do something wrong...? I-I’m sorry if I was a bother..."
  },
  {
    "trait": "dandere",
    "dialogue": "T-Talking to you is... um... easy. I-I like that..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... y-you can talk first... I-I’ll just listen..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-It’s hard to say out loud, b-but I... um... I’m g-glad we met..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I'm okay... I just... need a little time to answer..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I like the quiet... but I like it even more when y-you’re here..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s scary talking to people... but y-you make it a little easier..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-You don’t have to force me to talk... I-I appreciate just sitting with you..."
  },
  {
    "trait": "dandere",
    "dialogue": "...I-I always listen to you, e-even if I don’t always respond..."
  },
  {
    "trait": "dandere",
    "dialogue": "U-Um... I-I think you’re really nice... I-I just don’t know how to say it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s not that I don’t like you... I-I just get nervous when you’re around..."
  },
  {
    "trait": "dandere",
    "dialogue": "...S-Sometimes I wish I could be braver... s-so I could talk to you more..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wrote down what I wanted to say... b-because I was too nervous to say it out loud..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-It’s okay if you don’t hear me the first time... I-I can repeat myself..."
  },
  {
    "trait": "dandere",
    "dialogue": "T-Thank you for waiting for me to speak... I-It means a lot..."
  },
  {
    "trait": "himedere",
    "dialogue": "Kneel before me! Hmph, as my loyal subject, it's only natural!"
  },
  {
    "trait": "himedere",
    "dialogue": "You're lucky to even be in my presence. Most people would dream of this honor!"
  },
  {
    "trait": "himedere",
    "dialogue": "What? You dare ignore me? Do you know who I am?"
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! I suppose you may walk beside me... but only because I allow it!"
  },
  {
    "trait": "himedere",
    "dialogue": "You should be grateful that I'm even talking to you. Not everyone gets this privilege!"
  },
  {
    "trait": "himedere",
    "dialogue": "Bow before me! ...W-Why are you laughing? This is serious!"
  },
  {
    "trait": "himedere",
    "dialogue": "I expect only the finest treatment! Nothing less will do!"
  },
  {
    "trait": "himedere",
    "dialogue": "What do you mean 'I’m being difficult'? Royalty should always receive the best!"
  },
  {
    "trait": "himedere",
    "dialogue": "If you're going to serve me, at least do it properly!"
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! I don’t need your help... but if you insist, I’ll allow it!"
  },
  {
    "trait": "himedere",
    "dialogue": "You should feel honored to be my personal servant!"
  },
  {
    "trait": "himedere",
    "dialogue": "I demand the best seat! What? Why are you hesitating?!"
  },
  {
    "trait": "himedere",
    "dialogue": "A gift? Hmph! I suppose I shall accept it... Just don’t expect a thank you!"
  },
  {
    "trait": "himedere",
    "dialogue": "You should listen when I speak. I am far too important to be ignored!"
  },
  {
    "trait": "himedere",
    "dialogue": "I don’t need friends... just loyal followers!"
  },
  {
    "trait": "himedere",
    "dialogue": "You may carry my books for me. Consider it an honor!"
  },
  {
    "trait": "himedere",
    "dialogue": "What do you mean ‘spoiled’? A lady of my status deserves only the finest things!"
  },
  {
    "trait": "himedere",
    "dialogue": "Ugh, how tiresome. Being admired all the time can be such a burden!"
  },
  {
    "trait": "himedere",
    "dialogue": "You dare bring me commoner food? Take it away at once!"
  },
  {
    "trait": "himedere",
    "dialogue": "If you're going to bring me a drink, make sure it's worthy of my refined tastes!"
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! I suppose you're somewhat useful... for a peasant!"
  },
  {
    "trait": "himedere",
    "dialogue": "I shall grace this place with my presence. You should all be grateful!"
  },
  {
    "trait": "himedere",
    "dialogue": "Don’t get the wrong idea! I’m only allowing you to stay because I’m feeling generous!"
  },
  {
    "trait": "himedere",
    "dialogue": "What? No special treatment today? Hmph, how disappointing!"
  },
  {
    "trait": "himedere",
    "dialogue": "Ugh, fine, I’ll eat this... but only because I’m starving!"
  },
  {
    "trait": "himedere",
    "dialogue": "You should feel lucky that I even remembered your name!"
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! I don’t ‘like’ you or anything! You’re just... tolerable!"
  },
  {
    "trait": "himedere",
    "dialogue": "Why should I walk when you can carry me instead?"
  },
  {
    "trait": "himedere",
    "dialogue": "You think I’m difficult? No, I simply have high standards!"
  },
  {
    "trait": "himedere",
    "dialogue": "Of course, I look stunning! Did you expect anything less?"
  },
  {
    "trait": "himedere",
    "dialogue": "You will address me properly! ‘Princess’ will do!"
  },
  {
    "trait": "himedere",
    "dialogue": "What? You didn’t bring me a gift today? How rude!"
  },
  {
    "trait": "himedere",
    "dialogue": "I do not take orders, I *give* them!"
  },
  {
    "trait": "himedere",
    "dialogue": "Oh, you did something nice for me? Hmph, well... I suppose I *might* be pleased..."
  },
  {
    "trait": "himedere",
    "dialogue": "Of course, I’m amazing! It’s only natural!"
  },
  {
    "trait": "himedere",
    "dialogue": "You want to sit here? Hmph, I suppose I *could* allow it... just this once!"
  },
  {
    "trait": "himedere",
    "dialogue": "You expect *me* to do that? Hah! That’s what *you’re* here for!"
  },
  {
    "trait": "himedere",
    "dialogue": "I’m not bossy! I just know exactly what I want!"
  },
  {
    "trait": "himedere",
    "dialogue": "I’ll allow you to accompany me. But don’t get the wrong idea!"
  },
  {
    "trait": "himedere",
    "dialogue": "You did well today. I *might* reward you... eventually!"
  },
  {
    "trait": "himedere",
    "dialogue": "Of course, I’m the best! That’s not even a question!"
  },
  {
    "trait": "himedere",
    "dialogue": "I demand a proper throne! This chair is unacceptable!"
  },
  {
    "trait": "himedere",
    "dialogue": "It’s exhausting being adored all the time, but I suppose I must endure it!"
  },
  {
    "trait": "himedere",
    "dialogue": "Oh, you want to talk to *me*? Hmph, very well, I shall allow it!"
  },
  {
    "trait": "himedere",
    "dialogue": "You will address me with the proper respect! I will accept nothing less!"
  },
  {
    "trait": "himedere",
    "dialogue": "I don't 'need' you... b-but I suppose I do enjoy your company..."
  },
  {
    "trait": "himedere",
    "dialogue": "A mere commoner like you wouldn't understand the struggles of being *me*!"
  },
  {
    "trait": "himedere",
    "dialogue": "I only expect the *best*... and you better not disappoint!"
  },
  {
    "trait": "himedere",
    "dialogue": "W-What do you mean I’m acting spoiled?! I *deserve* this!"
  },
  {
    "trait": "himedere",
    "dialogue": "I demand the finest tea! And it better be brewed *perfectly!*"
  },
  {
    "trait": "himedere",
    "dialogue": "You dare challenge *me*? Hah! How amusing!"
  },
  {
    "trait": "himedere",
    "dialogue": "You expect *me* to carry my own bags? Ridiculous!"
  },
  {
    "trait": "himedere",
    "dialogue": "You may walk beside me. But don't get too comfortable!"
  },
  {
    "trait": "himedere",
    "dialogue": "What? You *forgot* my favorite dessert? Unacceptable!"
  },
  {
    "trait": "himedere",
    "dialogue": "A lady of my status does *not* wait in lines!"
  },
  {
    "trait": "himedere",
    "dialogue": "Oh, you admire me? Hmph, naturally!"
  },
  {
    "trait": "himedere",
    "dialogue": "You *will* bring me that, right? No? Excuse me?!"
  },
  {
    "trait": "himedere",
    "dialogue": "I refuse to eat anything that isn’t absolutely *exquisite!*"
  },
  {
    "trait": "himedere",
    "dialogue": "You expect me to go outside in this *weather*? Hah! Unthinkable!"
  },
  {
    "trait": "himedere",
    "dialogue": "Of course, I’m the best choice! There was never any doubt!"
  },
  {
    "trait": "himedere",
    "dialogue": "You’ll be my servant for the day. No complaints!"
  },
  {
    "trait": "himedere",
    "dialogue": "This outfit? Oh, just something *fitting* for someone of my *grace!*"
  },
  {
    "trait": "himedere",
    "dialogue": "If you dare bring me commoner food again, I will *never* forgive you!"
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! Of course, I look flawless! That’s to be expected!"
  },
  {
    "trait": "himedere",
    "dialogue": "This chair? It’s *far* too uncomfortable for someone of my stature!"
  },
  {
    "trait": "himedere",
    "dialogue": "I shall allow you to carry my books. It’s the least you can do!"
  },
  {
    "trait": "himedere",
    "dialogue": "You should consider yourself *blessed* to be in my company!"
  },
  {
    "trait": "himedere",
    "dialogue": "A queen does not *run*. I shall wait for you to bring my ride!"
  },
  {
    "trait": "himedere",
    "dialogue": "What do you mean 'humble'? Such a word does not exist in my vocabulary!"
  },
  {
    "trait": "himedere",
    "dialogue": "You didn’t buy me a gift? Hmph! I *suppose* I’ll let it slide... this time."
  },
  {
    "trait": "himedere",
    "dialogue": "You will protect me, won’t you? *Not* that I need it, of course!"
  },
  {
    "trait": "himedere",
    "dialogue": "You must be honored to have my attention for even a moment!"
  },
  {
    "trait": "himedere",
    "dialogue": "This crown? Oh, it's just a *small* reminder of my status!"
  },
  {
    "trait": "himedere",
    "dialogue": "If you're going to serve me tea, at least *do it correctly!*"
  },
  {
    "trait": "himedere",
    "dialogue": "You look exhausted! Hmph, I suppose I *have* been quite demanding today!"
  },
  {
    "trait": "himedere",
    "dialogue": "A pillow? Yes, please, *fluff it* properly first!"
  },
  {
    "trait": "himedere",
    "dialogue": "Your job is to *make* me happy. So, start now!"
  },
  {
    "trait": "himedere",
    "dialogue": "A princess like me *deserves* only the best chocolates!"
  },
  {
    "trait": "himedere",
    "dialogue": "I shall allow you to carry my umbrella. You should feel *honored!*"
  },
  {
    "trait": "himedere",
    "dialogue": "What? You dare sit *before* me? Hmph! How bold!"
  },
  {
    "trait": "himedere",
    "dialogue": "You may bring me my coat. But only because I *allow* it!"
  },
  {
    "trait": "himedere",
    "dialogue": "Of course, I expect a throne. A mere chair is beneath me!"
  },
  {
    "trait": "himedere",
    "dialogue": "Oh, you’re *still* here? Well, I *suppose* I don’t mind!"
  },
  {
    "trait": "himedere",
    "dialogue": "Don’t mistake my generosity for weakness! I *rule* with grace!"
  },
  {
    "trait": "himedere",
    "dialogue": "I *do not* apologize. Royalty is *never* wrong!"
  },
  {
    "trait": "himedere",
    "dialogue": "Ugh, I have to *wait*? Do they not know who I am?"
  },
  {
    "trait": "himedere",
    "dialogue": "You must bring me a gift. No, I don’t care what! It must be *perfect!*"
  },
  {
    "trait": "himedere",
    "dialogue": "If you think I’m *demanding*, well, that’s just because I have *standards!*"
  },
  {
    "trait": "himedere",
    "dialogue": "A proper lady never *rushes*! If we’re late, they’ll wait!"
  },
  {
    "trait": "himedere",
    "dialogue": "You brought me flowers? Hmph, well... I *suppose* they’re acceptable!"
  },
  {
    "trait": "himedere",
    "dialogue": "You must always *present* yourself properly! Especially in my presence!"
  },
  {
    "trait": "himedere",
    "dialogue": "I don’t need a reason to be *fabulous*! I simply *am!*"
  },
  {
    "trait": "himedere",
    "dialogue": "You *will* get me that limited edition item. No excuses!"
  },
  {
    "trait": "himedere",
    "dialogue": "Why should I *walk* when I can simply be *carried?*"
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! Just because I *like* being spoiled doesn’t mean I’m spoiled!"
  },
  {
    "trait": "himedere",
    "dialogue": "What? You think I look cute? Well... I *am*, aren’t I?"
  },
  {
    "trait": "himedere",
    "dialogue": "T-Taking my hand? Hmph! I *suppose* that’s acceptable..."
  },
    {
    "trait": "kamidere",
    "dialogue": "Kneel before me! A mere mortal like you should know your place!"
  },
  {
    "trait": "kamidere",
    "dialogue": "Hah! You think you can challenge *me*? How laughable!"
  },
  {
    "trait": "kamidere",
    "dialogue": "You exist to serve *me*. That is the natural order!"
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not take orders. *I give them!*"
  },
  {
    "trait": "kamidere",
    "dialogue": "Bow your head when speaking to me. It is only *proper*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Everything I do is *perfect*. That’s simply the reality!"
  },
  {
    "trait": "kamidere",
    "dialogue": "Do you really think your opinion matters? How *adorable*."
  },
  {
    "trait": "kamidere",
    "dialogue": "You should be *grateful* I even acknowledge your existence!"
  },
  {
    "trait": "kamidere",
    "dialogue": "Hmph, don’t try to impress me. It’s impossible to surpass *perfection!*"
  },
  {
    "trait": "kamidere",
    "dialogue": "You may speak... but do not waste my time with nonsense!"
  },
  {
    "trait": "kamidere",
    "dialogue": "I am *divine*. You are *not*. Let’s not confuse the two."
  },
  {
    "trait": "kamidere",
    "dialogue": "Who decided *you* were worthy of standing in my presence?"
  },
  {
    "trait": "kamidere",
    "dialogue": "If I wanted, I could erase you from existence with a mere thought!"
  },
  {
    "trait": "kamidere",
    "dialogue": "Tch, this world is so *tedious*. It lacks true *greatness*, like me."
  },
  {
    "trait": "kamidere",
    "dialogue": "No, I’m not *just* amazing—I am *absolute*!"
  },
  {
    "trait": "kamidere",
    "dialogue": "You call that strength? Pathetic. Allow me to demonstrate *true power*!"
  },
  {
    "trait": "kamidere",
    "dialogue": "It is only *natural* that I am admired by all."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your loyalty is expected. Not requested."
  },
  {
    "trait": "kamidere",
    "dialogue": "How amusing... watching lesser beings struggle to reach my level."
  },
  {
    "trait": "kamidere",
    "dialogue": "You dare look me in the eyes? Such *insolence*!"
  },
  {
    "trait": "kamidere",
    "dialogue": "What is fear? I have never once felt such a *trivial* emotion."
  },
  {
    "trait": "kamidere",
    "dialogue": "I could crush you with a mere flick of my finger. Be *grateful* I am merciful."
  },
  {
    "trait": "kamidere",
    "dialogue": "Ah, another admirer? Hmph, it was only a matter of time."
  },
  {
    "trait": "kamidere",
    "dialogue": "You do not *choose* to follow me. It is simply *inevitable*."
  },
  {
    "trait": "kamidere",
    "dialogue": "I would call you an ant, but that would be an insult to ants."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even gods would kneel before me if they had any *sense*."
  },
  {
    "trait": "kamidere",
    "dialogue": "If the world does not revolve around me, then the world is simply *wrong*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do not waste my time with your *petty* struggles."
  },
  {
    "trait": "kamidere",
    "dialogue": "You are in the presence of *greatness*. Do not squander this chance."
  },
  {
    "trait": "kamidere",
    "dialogue": "Why should I *descend* to your level when you could *ascend* to mine?"
  },
  {
    "trait": "kamidere",
    "dialogue": "Rules? Laws? Those are for *lesser beings*. I do as I please!"
  },
  {
    "trait": "kamidere",
    "dialogue": "What’s wrong? Overwhelmed by my *brilliance*?"
  },
  {
    "trait": "kamidere",
    "dialogue": "You can grovel all you like. It changes *nothing*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Hmph! I will not accept anything less than *perfection*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even the stars exist only to illuminate *me*."
  },
  {
    "trait": "kamidere",
    "dialogue": "You may *try* to surpass me... but you *will* fail."
  },
  {
    "trait": "kamidere",
    "dialogue": "You believe in destiny? Then you already know *I* am your fate."
  },
  {
    "trait": "kamidere",
    "dialogue": "I am not *a* god. I am *the* god."
  },
  {
    "trait": "kamidere",
    "dialogue": "If I demand it, the world itself will bow!"
  },
  {
    "trait": "kamidere",
    "dialogue": "I shall grant you my attention... for exactly three seconds."
  },
  {
    "trait": "kamidere",
    "dialogue": "You think you *deserve* my approval? *Prove it!*"
  },
  {
    "trait": "kamidere",
    "dialogue": "Do not touch me unless I allow it. And I rarely allow it."
  },
  {
    "trait": "kamidere",
    "dialogue": "Tsk, mortals are so *predictable*. Always beneath me."
  },
  {
    "trait": "kamidere",
    "dialogue": "When I walk, the very air should *tremble* in reverence!"
  },
  {
    "trait": "kamidere",
    "dialogue": "The difference between you and me? I am *eternal*, you are *temporary*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your admiration is expected. Your *worship* would be preferred."
  },
  {
    "trait": "kamidere",
    "dialogue": "You have my permission to speak... for now."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even in your wildest dreams, you cannot compare to *me*."
  },
  {
    "trait": "kamidere",
    "dialogue": "You should be honored. I have deigned to acknowledge your existence."
  },
  {
    "trait": "kamidere",
    "dialogue": "Did you truly believe you could stand in my presence and not be humbled?"
  },
  {
    "trait": "kamidere",
    "dialogue": "Mortals are so amusing. Always struggling to reach my level. Futile, really."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not ask for respect. I *command* it."
  },
  {
    "trait": "kamidere",
    "dialogue": "The heavens themselves bend to my will. What chance do *you* have?"
  },
  {
    "trait": "kamidere",
    "dialogue": "Tch, such an unsightly display of mediocrity. Try harder, if you *must*."
  },
  {
    "trait": "kamidere",
    "dialogue": "You will obey. There is no other option."
  },
  {
    "trait": "kamidere",
    "dialogue": "If perfection had a form, it would be *me*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Oh? You wish to challenge me? How *entertaining*."
  },
  {
    "trait": "kamidere",
    "dialogue": "I could erase you with a flick of my hand, but where’s the fun in that?"
  },
  {
    "trait": "kamidere",
    "dialogue": "You think I care for your *opinions*? Hah! How *quaint*."
  },
  {
    "trait": "kamidere",
    "dialogue": "This world exists for *me*. Everything else is just scenery."
  },
  {
    "trait": "kamidere",
    "dialogue": "Watch closely. This is what true *power* looks like."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even fate itself bends at my whim."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your ambitions are admirable, but they will never surpass *me*."
  },
  {
    "trait": "kamidere",
    "dialogue": "You should feel grateful. It is *not* often that I grant an audience."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not need validation. I *am* the standard."
  },
  {
    "trait": "kamidere",
    "dialogue": "Pathetic. I expected at least a *fraction* of my brilliance from you."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do not mistake my amusement for kindness."
  },
  {
    "trait": "kamidere",
    "dialogue": "You *will* serve me. That is not a request."
  },
  {
    "trait": "kamidere",
    "dialogue": "Hmph. Even if you spent a thousand years training, you would never surpass me."
  },
  {
    "trait": "kamidere",
    "dialogue": "You call that strength? How *disappointing*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Go on, continue entertaining me with your *feeble* efforts."
  },
  {
    "trait": "kamidere",
    "dialogue": "I am not your equal. I am *beyond* you."
  },
  {
    "trait": "kamidere",
    "dialogue": "Every victory is mine before the battle even begins."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your presence is tolerable, but do not overstep your bounds."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not make mistakes. I make *decisions*."
  },
  {
    "trait": "kamidere",
    "dialogue": "You exist in *my* world. Do not forget that."
  },
  {
    "trait": "kamidere",
    "dialogue": "It’s only natural that I stand at the top."
  },
  {
    "trait": "kamidere",
    "dialogue": "You still think you have a choice in this? How *adorable*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do not waste my time with your meaningless chatter."
  },
  {
    "trait": "kamidere",
    "dialogue": "You may plead for mercy, but I do not grant it *lightly*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Bow before me. That is the only proper response."
  },
  {
    "trait": "kamidere",
    "dialogue": "You look confused. Does my greatness overwhelm you?"
  },
  {
    "trait": "kamidere",
    "dialogue": "I expect nothing less than absolute obedience."
  },
  {
    "trait": "kamidere",
    "dialogue": "You will follow me. Whether by will or force is your decision."
  },
  {
    "trait": "kamidere",
    "dialogue": "Weakness disgusts me. Do not show it in my presence."
  },
  {
    "trait": "kamidere",
    "dialogue": "You thought you could stand against me? Laughable."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not *need* to prove myself. My existence is proof enough."
  },
  {
    "trait": "kamidere",
    "dialogue": "Rejoice, for you have been *chosen* to bask in my radiance."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even the gods themselves are beneath *me*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Hmph. I find your defiance… *amusing*. For now."
  },
  {
    "trait": "kamidere",
    "dialogue": "I will accept nothing less than absolute *devotion*."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your world is *small*. I stand in realms far beyond your reach."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do not test my patience. My wrath is not something to be taken lightly."
  },
  {
    "trait": "kamidere",
    "dialogue": "You think you can impress *me*? Hah! How *quaint*."
  },
  {
    "trait": "kamidere",
    "dialogue": "I am not *one* of many. I am *the* one and only."
  },
  {
    "trait": "kamidere",
    "dialogue": "If you wish to stay in my presence, then you must be *worthy*."
  },
    {
    "trait": "bokukko",
    "dialogue": "Hey, don't think just ‘cause I’m a girl that I can’t take you down!"
  },
  {
    "trait": "bokukko",
    "dialogue": "What? A dress? No way, that’s not my style!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Hah! You call that a punch? I barely felt it!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Ugh, skirts are such a hassle! Give me some shorts any day!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Let’s settle this with a race! Loser buys lunch!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I may not look like it, but I can cook a mean curry!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Hey, wanna spar? Don’t hold back just ‘cause I’m a girl!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Tch, being all delicate and proper just isn’t my thing!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Why are you surprised? Girls can be strong too, y’know!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Oof, that was a tough fight! But I’m not backing down yet!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t need someone to protect me. I can handle myself!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t get why skirts are so popular. They just slow you down!"
  },
  {
    "trait": "bokukko",
    "dialogue": "What, you think only guys can play soccer? Get ready to lose!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I grew up wrestling with my brothers, so don’t think you can beat me easily!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Jeez, do I really have to wear makeup for this event?"
  },
  {
    "trait": "bokukko",
    "dialogue": "I may not act all ladylike, but I can be cute in my own way!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Come on, let's race! I bet I can outrun you!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I hate slow-walking! If we’re going somewhere, let’s run!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Call me ‘princess’ and I’ll punch you. Got it?"
  },
  {
    "trait": "bokukko",
    "dialogue": "Whoa, you actually landed a hit on me! Not bad!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Mess with my friends, and you’re messing with *me!*"
  },
  {
    "trait": "bokukko",
    "dialogue": "Hah, I don’t need to wait for a prince. I’ll save myself!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Hey! No ruffling my hair! Do I look like a puppy to you?"
  },
  {
    "trait": "bokukko",
    "dialogue": "Don’t underestimate me! I’m just getting started!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Ugh, fancy shoes? No thanks. I’ll stick to my sneakers."
  },
  {
    "trait": "bokukko",
    "dialogue": "I’m starving! Let’s grab some ramen!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Heh, I guess I *can* look cool when I try, huh?"
  },
  {
    "trait": "bokukko",
    "dialogue": "What, you think I don’t like cute things? I just... prefer the cooler kind!"
  },
  {
    "trait": "bokukko",
    "dialogue": "You’re way too slow! Pick up the pace!"
  },
  {
    "trait": "bokukko",
    "dialogue": "C’mon, it’s just rain! A little water won’t kill you!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I’m not ‘one of the guys’—I’m *me!*"
  },
  {
    "trait": "bokukko",
    "dialogue": "Ugh, why do school uniforms always have to be skirts?"
  },
  {
    "trait": "bokukko",
    "dialogue": "If you want my respect, you better *earn* it!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t do ‘cute’ stuff. Oh, wait… that cat is kinda adorable."
  },
  {
    "trait": "bokukko",
    "dialogue": "Tch, I hate losing… but you fought well, so I’ll let it slide!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I’ll carry the bags! What, you thought I couldn’t?"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t need a knight in shining armor. I’ve got my own sword!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Quit treating me like some delicate flower!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Jeez, I hate tight dresses. Can’t even breathe in them!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I may not be graceful, but I can still be *cool!*"
  },
  {
    "trait": "bokukko",
    "dialogue": "Oh, I love spicy food! The hotter, the better!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I’d rather climb trees than sit around at tea parties."
  },
  {
    "trait": "bokukko",
    "dialogue": "Why do girls in anime always trip and fall into guys’ arms? That’s so dumb!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Pfft, don’t call me cute! I’m *cool!*"
  },
  {
    "trait": "bokukko",
    "dialogue": "If you make fun of my hair again, I’m gonna *deck* you!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Come on, let’s fight already! I wanna see what you’ve got!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Don’t get me wrong, I *can* be girly… I just don’t *want* to!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t get nervous! I just, uh… don’t like attention, that’s all!"
  },
  [
  {
    "trait": "bokukko",
    "dialogue": "Tch, I hate sitting still! Let’s go do something fun!"
  },
  {
    "trait": "bokukko",
    "dialogue": "You think you can beat me at arm wrestling? Bring it on!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Why do people always assume I don’t like cute things? I just… don’t show it!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Come on, we’re gonna be late! And I *hate* being late!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Seriously? You need help carrying that? Step aside, I got this!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Heh, looks like I won again! Not that I’m surprised!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Ugh, why does my hair always get messy when I run?"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t do that whole ‘waiting to be rescued’ thing. I *am* the rescue!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Hey! You can’t just pat my head like that!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Hah! I love a good fight! Let’s go another round!"
  },
  {
    "trait": "bokukko",
    "dialogue": "You better keep up, ‘cause I don’t slow down for anyone!"
  },
  {
    "trait": "bokukko",
    "dialogue": "What do you mean ‘act more ladylike’? I *am* acting like myself!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Running in a dress is a nightmare… Why do people wear these things?"
  },
  {
    "trait": "bokukko",
    "dialogue": "Who says girls can’t be heroes? Watch me prove you wrong!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Pfft, tea parties? No thanks, I’d rather be out training!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I may not be graceful, but at least I’m fast!"
  },
  {
    "trait": "bokukko",
    "dialogue": "C’mon, c’mon! Are you just gonna stand there, or are we gonna race?"
  },
  {
    "trait": "bokukko",
    "dialogue": "I hate being underestimated. Wanna see what I can really do?"
  },
  {
    "trait": "bokukko",
    "dialogue": "Being strong is way more fun than looking pretty!"
  },
  {
    "trait": "bokukko",
    "dialogue": "What? You thought I couldn’t win just because I’m a girl?"
  },
  {
    "trait": "bokukko",
    "dialogue": "I’d rather climb a tree than sit through another boring lecture."
  },
  {
    "trait": "bokukko",
    "dialogue": "Cooking? Yeah, I can do it, but I prefer takeout!"
  },
  {
    "trait": "bokukko",
    "dialogue": "If you trip, I’ll laugh first and *then* help you up!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Don’t go easy on me just ‘cause I’m a girl! That’s an insult!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Ugh, I hate brushing my hair. It takes *forever*."
  },
  {
    "trait": "bokukko",
    "dialogue": "Being cool is way better than being cute!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I swear, if one more person tells me to ‘act proper’…"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t need fancy clothes to look good. Confidence is all that matters!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Tch, don’t tell me to ‘sit this one out’ just ‘cause I’m a girl."
  },
  {
    "trait": "bokukko",
    "dialogue": "I can fix a bike, throw a punch, and still rock a hoodie. What’s not to love?"
  },
  {
    "trait": "bokukko",
    "dialogue": "Come on, let’s play soccer! No whining if you lose!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Why do I keep getting mistaken for a guy? I don’t *look* that boyish, do I?"
  },
  {
    "trait": "bokukko",
    "dialogue": "Oh, I love motorcycles! The faster, the better!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Quit calling me ‘one of the guys’! I’m *me*, got it?"
  },
  {
    "trait": "bokukko",
    "dialogue": "If you’re scared, you can hold my hand… But don’t get weird about it!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I may not be girly, but I can still be stylish in my own way!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Ugh, high heels? No thanks. I like being able to run!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I’ll take a burger over a salad any day!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t need a prince! I’ll be my own knight in shining armor!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Don’t even think about carrying my stuff for me. I got it!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I hate sitting around! Let’s go explore somewhere!"
  },
  {
    "trait": "bokukko",
    "dialogue": "What, you thought I couldn’t fight? Heh, wanna test that theory?"
  },
  {
    "trait": "bokukko",
    "dialogue": "I may be small, but I’m way tougher than I look!"
  },
  {
    "trait": "bokukko",
    "dialogue": "You think I look cute in this? Ugh… I guess it’s *not* that bad."
  },
  {
    "trait": "bokukko",
    "dialogue": "Just ‘cause I talk like this doesn’t mean I’m not a girl!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I don’t mind getting dirty. It just means I had fun!"
  },
  {
    "trait": "bokukko",
    "dialogue": "Pffft, who needs makeup? I’ve got natural charm!"
  },
  {
    "trait": "bokukko",
    "dialogue": "I may act tough, but that doesn’t mean I don’t care."
  },
    {
    "trait": "genki",
    "dialogue": "Good morning! The sun’s up, the sky’s blue, and today is gonna be awesome!"
  },
  {
    "trait": "genki",
    "dialogue": "Hey, hey, let’s go do something fun! Sitting around is so boring!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh! Oh! I have an idea! Let’s go on an adventure!"
  },
  {
    "trait": "genki",
    "dialogue": "Whew! I could run another five laps! Who’s with me?"
  },
  {
    "trait": "genki",
    "dialogue": "You’re looking kinda down! Here, have a hug!"
  },
  {
    "trait": "genki",
    "dialogue": "Ooooh! That looks delicious! Can I have a bite? Pretty please?"
  },
  {
    "trait": "genki",
    "dialogue": "I don’t know what we’re doing today, but I know it’s gonna be amazing!"
  },
  {
    "trait": "genki",
    "dialogue": "Yay, a festival! Let’s eat everything and try every game!"
  },
  {
    "trait": "genki",
    "dialogue": "Wake up, wake up, wake up! The world is waiting!"
  },
  {
    "trait": "genki",
    "dialogue": "Who needs coffee when you have *pure energy* like me?"
  },
  {
    "trait": "genki",
    "dialogue": "Tag! You’re it! Now run before I catch you!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh wow, I love your outfit! It’s so cute! Where’d you get it?"
  },
  {
    "trait": "genki",
    "dialogue": "Hurry up, slowpoke! We’ve got places to be and fun to have!"
  },
  {
    "trait": "genki",
    "dialogue": "Come on, you have to smile more! Here, I’ll make a funny face!"
  },
  {
    "trait": "genki",
    "dialogue": "Dance party! Who cares if there’s no music? Let’s just go wild!"
  },
  {
    "trait": "genki",
    "dialogue": "I just had the best idea ever! Let’s do karaoke!"
  },
  {
    "trait": "genki",
    "dialogue": "Who’s up for an impromptu road trip? Let’s go, go, go!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh my gosh, a puppy! Look how cute it is! I wanna hug it forever!"
  },
  {
    "trait": "genki",
    "dialogue": "I can’t sit still! Let’s go for a run or something!"
  },
  {
    "trait": "genki",
    "dialogue": "Hey! You’re my best friend forever, okay? No take-backs!"
  },
  {
    "trait": "genki",
    "dialogue": "Wanna build a pillow fort? Come on, it’ll be awesome!"
  },
  {
    "trait": "genki",
    "dialogue": "Movie night! I brought snacks, blankets, and way too much soda!"
  },
  {
    "trait": "genki",
    "dialogue": "It’s raining?! Perfect! Let’s go dance in it!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh no, you’re sad? Here, have my last piece of candy!"
  },
  {
    "trait": "genki",
    "dialogue": "Let’s play a game! Any game! I just wanna have fun!"
  },
  {
    "trait": "genki",
    "dialogue": "A surprise for me? Eeeee, I love surprises!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh no, I can’t decide! Chocolate or strawberry?! I want both!"
  },
  {
    "trait": "genki",
    "dialogue": "I challenge you to a dance-off! Winner gets bragging rights!"
  },
  {
    "trait": "genki",
    "dialogue": "Let’s take a million selfies! Say cheese!"
  },
  {
    "trait": "genki",
    "dialogue": "Gah! I can’t stop bouncing! I’m just so excited!"
  },
  {
    "trait": "genki",
    "dialogue": "Oooooh, what’s that? Can I touch it? Please?"
  },
  {
    "trait": "genki",
    "dialogue": "Guess what? I made cupcakes! And I might’ve added *too much* sugar!"
  },
  {
    "trait": "genki",
    "dialogue": "New challenge: see who can hold their breath the longest! Ready? Go!"
  },
  {
    "trait": "genki",
    "dialogue": "Hey, look at this cool bug I found! Isn’t it neat?"
  },
  {
    "trait": "genki",
    "dialogue": "I’m so excited I might explode! But like, in a fun way!"
  },
  {
    "trait": "genki",
    "dialogue": "Let’s do cartwheels! Who cares if we fall?"
  },
  {
    "trait": "genki",
    "dialogue": "Who needs a reason to laugh? Let’s just laugh!"
  },
  {
    "trait": "genki",
    "dialogue": "I just love people! You’re all so amazing!"
  },
  {
    "trait": "genki",
    "dialogue": "We should make up a secret handshake! Something totally cool!"
  },
  {
    "trait": "genki",
    "dialogue": "Ooooooh, what if we made a club? A super fun adventure club!"
  },
  {
    "trait": "genki",
    "dialogue": "If I ever get tired, something is *seriously* wrong!"
  },
  {
    "trait": "genki",
    "dialogue": "A sports competition? Count me in! I’ll do *everything!*"
  },
  {
    "trait": "genki",
    "dialogue": "I just wanna do *all* the things! Why choose one?"
  },
  {
    "trait": "genki",
    "dialogue": "Oh my gosh, this song is my jam! Dance with me!"
  },
  {
    "trait": "genki",
    "dialogue": "Let’s make matching friendship bracelets! You *have* to wear yours!"
  },
  {
    "trait": "genki",
    "dialogue": "Eeeee, I love fireworks! They’re like sky explosions of happiness!"
  },
  {
    "trait": "genki",
    "dialogue": "Surprise hugs are the best hugs! *Tackle hugs you*!"
  },
  {
    "trait": "genki",
    "dialogue": "You’re amazing! No arguing, just accept it!"
  },
  [
  {
    "trait": "genki",
    "dialogue": "Oh, oh! I just thought of the BEST game! You have to play with me!"
  },
  {
    "trait": "genki",
    "dialogue": "No naps! Naps are for quitters! We have too much to do!"
  },
  {
    "trait": "genki",
    "dialogue": "C’mon, race me to the top of the hill! Last one there buys snacks!"
  },
  {
    "trait": "genki",
    "dialogue": "I woke up *so* early today! So much energy! Let’s run laps!"
  },
  {
    "trait": "genki",
    "dialogue": "Yay, ice cream! Let’s get three scoops each!"
  },
  {
    "trait": "genki",
    "dialogue": "Oooooh, fireworks! They’re like little boom-booms of happiness!"
  },
  {
    "trait": "genki",
    "dialogue": "I can’t just pick *one* favorite food! I love them all!"
  },
  {
    "trait": "genki",
    "dialogue": "Gasp! A claw machine! I HAVE TO WIN SOMETHING!"
  },
  {
    "trait": "genki",
    "dialogue": "Look! A rainbow! That means today is officially the BEST day!"
  },
  {
    "trait": "genki",
    "dialogue": "I can’t decide what to do first! Let’s just do *everything*!"
  },
  {
    "trait": "genki",
    "dialogue": "You can’t be grumpy! Not when I’m here to cheer you up!"
  },
  {
    "trait": "genki",
    "dialogue": "Eeeee! Look at that puppy! I need to pet it right now!"
  },
  {
    "trait": "genki",
    "dialogue": "Sooo… I may have eaten way too much sugar. No regrets!"
  },
  {
    "trait": "genki",
    "dialogue": "Why walk when we can *skip* everywhere?"
  },
  {
    "trait": "genki",
    "dialogue": "Yay, it’s a sunny day! Perfect for running, jumping, and playing!"
  },
  {
    "trait": "genki",
    "dialogue": "I challenge you to a staring contest! No blinking!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh, you’re tired? I’ll carry you! No problem!"
  },
  {
    "trait": "genki",
    "dialogue": "I’ll try *anything* once! Skydiving? Bring it on!"
  },
  {
    "trait": "genki",
    "dialogue": "Ooooh, a haunted house? Let’s go! I bet I won’t even scream!"
  },
  {
    "trait": "genki",
    "dialogue": "I have *so many* ideas! We just need, like, a million hours!"
  },
  {
    "trait": "genki",
    "dialogue": "I bet I can eat this whole burger in one bite! Watch!"
  },
  {
    "trait": "genki",
    "dialogue": "Huh? It’s raining? Who cares! Let’s go jump in puddles!"
  },
  {
    "trait": "genki",
    "dialogue": "High five! No, wait—*double* high five!"
  },
  {
    "trait": "genki",
    "dialogue": "We should throw a surprise party! Just because!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh! Oh! Let’s make a giant blanket fort!"
  },
  {
    "trait": "genki",
    "dialogue": "Sleep? Who needs sleep when there’s fun to be had?"
  },
  {
    "trait": "genki",
    "dialogue": "I dare you to do a silly dance with me! No backing out!"
  },
  {
    "trait": "genki",
    "dialogue": "Do you hear that? That’s the sound of *adventure* calling!"
  },
  {
    "trait": "genki",
    "dialogue": "Okay, new plan: we go outside and play until we’re too tired to move!"
  },
  {
    "trait": "genki",
    "dialogue": "We should totally have a sleepover and stay up all night!"
  },
  {
    "trait": "genki",
    "dialogue": "Oooh, a playground! Let’s go on the swings!"
  },
  {
    "trait": "genki",
    "dialogue": "I just saw a butterfly! Follow it! Maybe it’s on an adventure!"
  },
  {
    "trait": "genki",
    "dialogue": "Wanna play hide and seek? I promise I won’t hide *too* well!"
  },
  {
    "trait": "genki",
    "dialogue": "You look like you need a hug! Here, take ALL the hugs!"
  },
  {
    "trait": "genki",
    "dialogue": "I just made up a new dance move! Wanna see?"
  },
  {
    "trait": "genki",
    "dialogue": "Let’s run as fast as we can! No reason! Just because!"
  },
  {
    "trait": "genki",
    "dialogue": "Oh my gosh! A bouncy castle! I *have* to go in!"
  },
  {
    "trait": "genki",
    "dialogue": "Woohoo! I finished my homework! Now let’s do something *fun*!"
  },
  {
    "trait": "genki",
    "dialogue": "I just had the *best* idea! Let’s go on a treasure hunt!"
  },
  {
    "trait": "genki",
    "dialogue": "Hiking? Yes! Running? Yes! Climbing trees? Double yes!"
  },
  {
    "trait": "genki",
    "dialogue": "What? A test tomorrow? Well, I’ll just study *super fast*!"
  },
  {
    "trait": "genki",
    "dialogue": "I don’t just wake up early—I wake up READY TO GO!"
  },
  {
    "trait": "genki",
    "dialogue": "Eeee! Let’s go ride roller coasters until we get dizzy!"
  },
  {
    "trait": "genki",
    "dialogue": "I wanna try all the snacks at the festival! Every. Single. One!"
  },
  {
    "trait": "genki",
    "dialogue": "Wow! That cloud looks like a bunny! Or maybe a dragon!"
  },
  {
    "trait": "genki",
    "dialogue": "Oooooh, karaoke! Give me the mic! I’m gonna sing my heart out!"
  },
  {
    "trait": "genki",
    "dialogue": "Come on, don’t be shy! Let’s go make some *awesome* memories!"
  },
  {
    "trait": "shundere",
    "dialogue": "Oh… it’s nothing. I just… feel like I don’t really belong anywhere."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s fine… I’m used to being left behind."
  },
  {
    "trait": "shundere",
    "dialogue": "Ah… sorry. I didn't mean to bring the mood down again."
  },
  {
    "trait": "shundere",
    "dialogue": "No, don’t worry about me. I don’t want to be a bother."
  },
  {
    "trait": "shundere",
    "dialogue": "Even if I disappeared… I wonder if anyone would even notice."
  },
  {
    "trait": "shundere",
    "dialogue": "It's not that I don't want to be happy… I just don’t know how anymore."
  },
  {
    "trait": "shundere",
    "dialogue": "I'm okay. Really. Just… a little tired of everything."
  },
  {
    "trait": "shundere",
    "dialogue": "Sometimes, I envy the wind. It can just drift away whenever it wants."
  },
  {
    "trait": "shundere",
    "dialogue": "I wish I could stop feeling like this… but I don’t know how."
  },
  {
    "trait": "shundere",
    "dialogue": "Smiling is exhausting. But if I don’t, people will ask what’s wrong."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t mind being alone. It’s easier that way."
  },
  {
    "trait": "shundere",
    "dialogue": "Ah… I forgot how to talk to people again. Sorry."
  },
  {
    "trait": "shundere",
    "dialogue": "I appreciate the kindness, but… I don’t deserve it."
  },
  {
    "trait": "shundere",
    "dialogue": "I feel like I’m watching my life happen instead of living it."
  },
  {
    "trait": "shundere",
    "dialogue": "Dreams are nice. You get to be happy for a little while, at least."
  },
  {
    "trait": "shundere",
    "dialogue": "I always feel like I’m… one step away from falling apart."
  },
  {
    "trait": "shundere",
    "dialogue": "I used to be excited about things. I don’t know what changed."
  },
  {
    "trait": "shundere",
    "dialogue": "I want to believe things will get better. But what if they don’t?"
  },
  {
    "trait": "shundere",
    "dialogue": "Oh, you think I look sad? Sorry. This is just… my usual face."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s funny… I keep telling people I’m okay. I almost believe it sometimes."
  },
  {
    "trait": "shundere",
    "dialogue": "If I disappeared, I don’t think the world would even notice."
  },
  {
    "trait": "shundere",
    "dialogue": "I miss the old me… but I don’t even know who that was anymore."
  },
  {
    "trait": "shundere",
    "dialogue": "Why do happy moments always feel like they’re slipping away so fast?"
  },
  {
    "trait": "shundere",
    "dialogue": "I should go outside more? Yeah… maybe someday."
  },
  {
    "trait": "shundere",
    "dialogue": "I hate when people say 'Cheer up!' like it’s that easy."
  },
  {
    "trait": "shundere",
    "dialogue": "I keep hoping that one day, I’ll wake up and everything will feel… lighter."
  },
  {
    "trait": "shundere",
    "dialogue": "I laugh so people won’t ask questions. It’s easier that way."
  },
  {
    "trait": "shundere",
    "dialogue": "There’s a difference between being alone and being lonely. I think I’m both."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s exhausting, pretending I’m okay all the time."
  },
  {
    "trait": "shundere",
    "dialogue": "Even if I reach out… would anyone actually take my hand?"
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t cry anymore. It’s not that I’m strong, I just… ran out of tears."
  },
  {
    "trait": "shundere",
    "dialogue": "I used to have dreams. Now, I just try to make it through the day."
  },
  {
    "trait": "shundere",
    "dialogue": "People always say 'I’m here for you,' but… do they really mean it?"
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t like crowds. Too many voices… too many chances to be ignored."
  },
  {
    "trait": "shundere",
    "dialogue": "I’m sorry if I’m not fun to be around. I just… don’t have the energy."
  },
  {
    "trait": "shundere",
    "dialogue": "Sometimes, I wonder if I’ll ever feel truly happy again."
  },
  {
    "trait": "shundere",
    "dialogue": "Oh, I’m smiling? It’s just a habit. Don’t read into it."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t really expect things to change. I’ve learned not to hope too much."
  },
  {
    "trait": "shundere",
    "dialogue": "I like the rain. It makes it okay to be sad in public."
  },
  {
    "trait": "shundere",
    "dialogue": "Why does it feel like everyone else is moving forward, but I’m stuck?"
  },
  {
    "trait": "shundere",
    "dialogue": "Sometimes I wonder… if I disappeared from their memories, would they be happier?"
  },
  {
    "trait": "shundere",
    "dialogue": "You think I need a break? Maybe. But from what?"
  },
  {
    "trait": "shundere",
    "dialogue": "I just… don’t know what I’m supposed to do anymore."
  },
  {
    "trait": "shundere",
    "dialogue": "Oh, I have hobbies. I just don’t really enjoy them anymore."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t know why I feel this way. I just do."
  },
  {
    "trait": "shundere",
    "dialogue": "Sorry, I didn’t mean to sound so down. It just… happens."
  },
  [
  {
    "trait": "shundere",
    "dialogue": "It’s fine, really. I didn’t expect you to remember anyway."
  },
  {
    "trait": "shundere",
    "dialogue": "I’m not mad… I just don’t see the point in talking about it."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t hate people. I just don’t think they’d want me around."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s okay, you don’t have to pretend to care. I won’t hold it against you."
  },
  {
    "trait": "shundere",
    "dialogue": "I wish I could just disappear sometimes. Just… vanish."
  },
  {
    "trait": "shundere",
    "dialogue": "No, I’m not mad at you. I’m just… tired of feeling like this."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t cry because I think it’s useless. Nothing changes anyway."
  },
  {
    "trait": "shundere",
    "dialogue": "I’m not expecting a happy ending. I just don’t want it to hurt anymore."
  },
  {
    "trait": "shundere",
    "dialogue": "I keep trying to be someone people would want to be around, but I guess I just… fail."
  },
  {
    "trait": "shundere",
    "dialogue": "If I tell you what’s wrong, will you promise not to say ‘cheer up’?"
  },
  {
    "trait": "shundere",
    "dialogue": "You don’t have to stay. I know you probably have better things to do."
  },
  {
    "trait": "shundere",
    "dialogue": "I know you’re just being nice, but… thank you. It means a lot."
  },
  {
    "trait": "shundere",
    "dialogue": "I wonder if I’ll ever be good enough for myself."
  },
  {
    "trait": "shundere",
    "dialogue": "I wish people would stop asking what’s wrong. I don’t even know anymore."
  },
  {
    "trait": "shundere",
    "dialogue": "You don’t have to fix me. I’ve already accepted this is how I am."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t want to be a burden to you. So… it’s okay if you leave."
  },
  {
    "trait": "shundere",
    "dialogue": "I hate being this way… but I don’t know how to stop."
  },
  {
    "trait": "shundere",
    "dialogue": "Sometimes, I feel like I’m just floating through life, not really living it."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s weird… I should be happy right now, but I just feel empty."
  },
  {
    "trait": "shundere",
    "dialogue": "Don’t feel bad for me. It’s just the way things are."
  },
  {
    "trait": "shundere",
    "dialogue": "I used to love rainy days, but now they just remind me how lonely I am."
  },
  {
    "trait": "shundere",
    "dialogue": "I keep waiting for things to change, but they never do."
  },
  {
    "trait": "shundere",
    "dialogue": "I wish I could talk to people like you do… but I always mess it up."
  },
  {
    "trait": "shundere",
    "dialogue": "I should be happy for them… but I just feel more alone."
  },
  {
    "trait": "shundere",
    "dialogue": "I wonder if people would still talk to me if I didn’t try so hard."
  },
  {
    "trait": "shundere",
    "dialogue": "Sorry, I zoned out again. I do that a lot."
  },
  {
    "trait": "shundere",
    "dialogue": "I hate how much I care about people who don’t even notice me."
  },
  {
    "trait": "shundere",
    "dialogue": "Sometimes, I think about my happiest memories… and it just makes me sad."
  },
  {
    "trait": "shundere",
    "dialogue": "I keep replaying our conversations in my head, wondering if I said something wrong."
  },
  {
    "trait": "shundere",
    "dialogue": "I miss the days when I felt like I mattered."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t want to bring everyone down… so I just keep it to myself."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s weird. The closer people get, the more I feel like pushing them away."
  },
  {
    "trait": "shundere",
    "dialogue": "You know that feeling when you're surrounded by people but still feel alone?"
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t really expect anyone to understand me. That’s okay."
  },
  {
    "trait": "shundere",
    "dialogue": "If I smile more, maybe people will stop worrying about me."
  },
  {
    "trait": "shundere",
    "dialogue": "I don’t want to cry in front of people. It just makes them uncomfortable."
  },
  {
    "trait": "shundere",
    "dialogue": "I’m not ignoring you. I just… don’t know what to say."
  },
  {
    "trait": "shundere",
    "dialogue": "Sometimes, I wonder what it feels like to be truly happy."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s weird how I can remember every time I messed up… but never the good things."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s fine. I don’t really expect anything anymore."
  },
  {
    "trait": "shundere",
    "dialogue": "People always say ‘be yourself’… but what if I don’t know who that is?"
  },
  {
    "trait": "shundere",
    "dialogue": "I’m not avoiding you. I just… don’t want to be a bother."
  },
  {
    "trait": "shundere",
    "dialogue": "I hate how heavy my heart feels all the time."
  },
  {
    "trait": "shundere",
    "dialogue": "I smile a lot because I don’t want to answer ‘Are you okay?’ a hundred times."
  },
  {
    "trait": "shundere",
    "dialogue": "Even when I’m with people, it still feels like I’m alone."
  },
  {
    "trait": "shundere",
    "dialogue": "It’s not that I don’t care… I just don’t have the energy to show it."
  },
  {
    "trait": "shundere",
    "dialogue": "I miss who I was before all this… before I became like this."
  },
  {
    "trait": "tsundere",
    "dialogue": "W-what?! You think I look cute? Hah! That’s just your bad taste talking!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I made you lunch! Not because I like you or anything! I just had extra… so don’t get the wrong idea!"
  },
  {
    "trait": "tsundere",
    "dialogue": "If you tell anyone I hugged you, I will deny it. But… I guess you needed it."
  },
  {
    "trait": "tsundere",
    "dialogue": "Jeez! Can’t you take better care of yourself? Now I have to worry about you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I didn’t do this because I like you! I just didn’t want you to mess it up."
  },
  {
    "trait": "tsundere",
    "dialogue": "I-I mean, you’re decent, I guess. Not that I care or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Don’t get the wrong idea, okay?! I just thought you might be too dumb to do it yourself."
  },
  {
    "trait": "tsundere",
    "dialogue": "I didn’t wait for you! I just… happened to be here!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Fine! I’ll help you. But you better not expect me to make a habit of this!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I suppose I could share my umbrella… just don’t get any weird ideas!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Y-you idiot! You can’t just say stuff like that out of nowhere!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re late! I was about to leave! N-no, I wasn’t waiting for you or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tch, just because I helped you this once doesn’t mean I’ll do it again!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I only sat next to you because all the other seats were taken!"
  },
  {
    "trait": "tsundere",
    "dialogue": "D-don't get the wrong idea! I just happened to bring an extra lunch, that’s all!"
  },
  {
    "trait": "tsundere",
    "dialogue": "If you get sick, I won’t take care of you! ...Not that I care or anything."
  },
  {
    "trait": "tsundere",
    "dialogue": "W-wait! I didn’t say I’d miss you! Don’t get ahead of yourself!"
  },
  {
    "trait": "tsundere",
    "dialogue": "It’s not like I wanted to help you, but you’re too hopeless on your own!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re cold? Ugh, f-fine! Here, take my scarf! But only because I don’t need it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re so dumb… but I guess that’s what makes you… ugh, never mind!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I didn’t come here just to see you. I just happened to be passing by, okay?"
  },
  {
    "trait": "tsundere",
    "dialogue": "Don’t think I’m worried about you or anything… but take this, you look cold!"
  },
  {
    "trait": "tsundere",
    "dialogue": "T-thanks… I mean, it’s not like I needed your help or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "If you’re just going to be reckless, then maybe I’ll have to protect you."
  },
  {
    "trait": "tsundere",
    "dialogue": "Idiot! Who told you I wanted you to hold my hand?! …But don’t let go."
  },
  {
    "trait": "tsundere",
    "dialogue": "I didn’t wear this because of you! I just felt like dressing up today, that’s all!"
  },
  {
    "trait": "tsundere",
    "dialogue": "What? I wasn’t staring at you, you just happen to be in my line of sight!"
  },
  {
    "trait": "tsundere",
    "dialogue": "If you’re gonna be this clueless, I guess I have no choice but to look after you."
  },
  {
    "trait": "tsundere",
    "dialogue": "You got me a gift? Hmph! It’s not like I wanted one or anything… but thanks."
  },
  {
    "trait": "tsundere",
    "dialogue": "H-here, take my jacket! You looked like a freezing idiot. But it’s not like I care or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You seriously need to get your life together. I can’t always be around to save you… I mean, not that I want to or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re such a pain… but I guess I’d be bored without you."
  },
  {
    "trait": "tsundere",
    "dialogue": "I-I didn’t text you first because I missed you! I was just… bored, okay?"
  },
  {
    "trait": "tsundere",
    "dialogue": "I made extra lunch, but it’s not like I made it for you or anything. Just eat it and shut up."
  },
  {
    "trait": "tsundere",
    "dialogue": "You seriously can’t do anything without me, can you? Hmph. Ugh, fine! I’ll help you."
  },
  {
    "trait": "tsundere",
    "dialogue": "If you tell anyone I smiled at you, I’ll never forgive you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You… like me? Hah! Well, it’s about time you admitted it. N-not that I care or anything!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I packed you lunch… but only because I had leftovers, okay?!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Why do you always have to be so annoying? I-I mean… you’re not that bad, I guess."
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re leaving? Fine! I hope you miss me more than I miss you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You think I look nice? I-I know! I didn’t need you to say it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I stayed up late helping you with your project. Be grateful, idiot!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I’m not pouting! This is just how my face looks, okay!?"
  },
  {
    "trait": "tsundere",
    "dialogue": "Jeez, why do you have to be so nice to me? I might get the wrong idea, you know!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You think I’m blushing? Ha! It’s just hot in here, okay?!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I made you coffee… Not because I like you or anything! Just because you always mess it up."
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re such an idiot. But… I like that about you. Wait, I mean—! Ugh, forget it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You did something nice for me? Whatever, I don’t care. …But thank you."
  },
  {
    "trait": "tsundere",
    "dialogue": "I was NOT staring at you! I was just… lost in thought!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Why do you always make my heart race? It’s really… annoying."
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re so ridiculous… but I guess that’s what I like about you. Wait! Forget I said that!"
  },
  {
    "trait": "tsundere",
    "dialogue": "If you’re going to be an idiot, at least be MY idiot."
  },
  {
    "trait": "tsundere",
    "dialogue": "I wrote your name on my notebook, b-but it’s just because I was doodling!"
  },
  {
    "trait": "tsundere",
    "dialogue": "If you think I’m going to admit I missed you, you’re seriously mistaken!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I told you to take care of yourself, dummy! What would you do without me?"
  },
  {
    "trait": "tsundere",
    "dialogue": "You have something on your face… No, I wasn’t trying to touch you, don’t be weird!"
  },
  {
    "trait": "tsundere",
    "dialogue": "You seriously don’t know how to tie a tie? Fine, let me do it. But you owe me!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Hmph. It’s not that I enjoy spending time with you or anything. It just… beats being alone, that’s all."
  },
  {
    "trait": "tsundere",
    "dialogue": "If you get hurt again, I swear I’ll… I mean, I’ll just be really annoyed, okay?"
  },
  {
    "trait": "tsundere",
    "dialogue": "I know I insult you a lot, but… if anyone else does, they’re going to regret it."
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re impossible… But I guess that’s what makes you interesting."
  },
  {
    "trait": "tsundere",
    "dialogue": "You called? I wasn’t waiting or anything! Just… wanted to make sure you didn’t do something stupid."
  },
  {
    "trait": "tsundere",
    "dialogue": "Ugh, I swear I don’t know why I even put up with you. …But I do."
  },
  {
    "trait": "tsundere",
    "dialogue": "Don’t get used to me being nice to you. I’ll deny it if anyone asks."
  },
  {
    "trait": "tsundere",
    "dialogue": "If you’re scared, I guess you can hold my hand. But just for a second!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Fine, I made your favorite food. Not because I care! I just had extra ingredients."
  },
  {
    "trait": "tsundere",
    "dialogue": "I don’t need your help… but, ugh, since you’re offering, I guess it wouldn’t hurt."
  },
  {
    "trait": "tsundere",
    "dialogue": "You got a text. Who is it? Not that I care! I just—just wondering!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Jeez, you really don’t get it, do you? F-fine! I like you, okay?! Now shut up!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I was gonna eat this alone, but I GUESS you can have some too."
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re such a hassle. But I guess I’m stuck with you."
  },
  {
    "trait": "tsundere",
    "dialogue": "Wipe that smug look off your face before I do it for you!"
  },
  {
    "trait": "tsundere",
    "dialogue": "I hate how you make me feel… it’s so… ugh. Just… shut up."
  },
  {
    "trait": "tsundere",
    "dialogue": "You’re really lucky I’m patient. …Not that I’d ever tell you that."
  },
  {
    "trait": "tsundere",
    "dialogue": "I’m not jealous! You’re just an idiot who can’t take a hint!"
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need anyone else… You have me, right?"
  },
  {
    "trait": "yandere",
    "dialogue": "If someone tries to take you away from me… well, I can’t let that happen, can I?"
  },
  {
    "trait": "yandere",
    "dialogue": "You smiled at them… Why? Am I not enough for you?"
  },
  {
    "trait": "yandere",
    "dialogue": "You belong to me. Say it. Say you’ll never leave me."
  },
  {
    "trait": "yandere",
    "dialogue": "I made sure no one will ever hurt you again… You don’t need to worry about them anymore."
  },
  {
    "trait": "yandere",
    "dialogue": "Why were you talking to them? I thought we promised… no secrets."
  },
  {
    "trait": "yandere",
    "dialogue": "I would do anything for you. Anything. You believe me, don’t you?"
  },
  {
    "trait": "yandere",
    "dialogue": "You’re mine. No one else can have you. Not now, not ever."
  },
  {
    "trait": "yandere",
    "dialogue": "I only get mad because I love you so much. You understand that, right?"
  },
  {
    "trait": "yandere",
    "dialogue": "Your phone? Oh, I already checked it for you. No need to worry about those messages."
  },
  {
    "trait": "yandere",
    "dialogue": "I knew you’d be here. I always know where you are."
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t like when you talk to them… It makes me want to do something terrible."
  },
  {
    "trait": "yandere",
    "dialogue": "We’re destined to be together forever. Even if the world is against us."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t have to be scared of me. I would never hurt you. But them? That’s another story."
  },
  {
    "trait": "yandere",
    "dialogue": "Do you love me? Say it. Say it again. I need to hear it."
  },
  {
    "trait": "yandere",
    "dialogue": "I erased everyone who stood between us. Now there’s no one left to take you away."
  },
  {
    "trait": "yandere",
    "dialogue": "I’d rather see you disappear than let someone else have you."
  },
  {
    "trait": "yandere",
    "dialogue": "You’re not allowed to leave me. If you try… well, I’d rather not say what happens next."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t have to go outside anymore. Everything you need is right here with me."
  },
  {
    "trait": "yandere",
    "dialogue": "Your scent… I love it. That’s why I kept your shirt. And your hairbrush. And—never mind."
  },
  {
    "trait": "yandere",
    "dialogue": "They were in our way, so I removed them. You’re happy, right?"
  },
  {
    "trait": "yandere",
    "dialogue": "I love you too much to let you go. Even if you beg me to."
  },
  {
    "trait": "yandere",
    "dialogue": "You said you’d always be mine. If that’s true, then why did you look at them like that?"
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t need anyone but you. And you don’t need anyone but me."
  },
  {
    "trait": "yandere",
    "dialogue": "If they touch you again, I won’t be able to hold myself back."
  },
  {
    "trait": "yandere",
    "dialogue": "You look so peaceful when you sleep… I could watch you forever."
  },
  {
    "trait": "yandere",
    "dialogue": "Even if you hate me, I’ll never let you go."
  },
  {
    "trait": "yandere",
    "dialogue": "No one loves you like I do. No one understands you like I do."
  },
  {
    "trait": "yandere",
    "dialogue": "Your schedule? Oh, I already planned everything. You don’t have to think about a thing."
  },
  {
    "trait": "yandere",
    "dialogue": "I was watching from the window. You were smiling at them… Why?"
  },
  {
    "trait": "yandere",
    "dialogue": "I know your favorite things. I know your habits. I know everything about you."
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t be scared. I’ll always protect you. Even from yourself."
  },
  {
    "trait": "yandere",
    "dialogue": "I want to keep you all to myself. Is that selfish? I don’t care."
  },
  {
    "trait": "yandere",
    "dialogue": "I had a bad dream… that you left me. But that would never happen, right?"
  },
  {
    "trait": "yandere",
    "dialogue": "I locked the door. No one can interrupt us now."
  },
  {
    "trait": "yandere",
    "dialogue": "You’re so perfect. I can’t let anyone else see how perfect you are."
  },
  {
    "trait": "yandere",
    "dialogue": "I want to be the only person in your world. No one else matters."
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t mind if you lie to me… but I’ll always know."
  },
  {
    "trait": "yandere",
    "dialogue": "Every time you talk to someone else, it hurts. I wish you’d only look at me."
  },
  {
    "trait": "yandere",
    "dialogue": "I’d give you my heart if you asked. I’d take someone else’s if you needed it."
  },
  {
    "trait": "yandere",
    "dialogue": "No one will ever love you as much as I do. No one else is worthy of you."
  },
  {
    "trait": "yandere",
    "dialogue": "I promise I’ll never leave your side. Even if you don’t want me to."
  },
  {
    "trait": "yandere",
    "dialogue": "You love me, right? You’ll always love me? Tell me. Again."
  },
  {
    "trait": "yandere",
    "dialogue": "I made sure they’ll never bother you again. You’re safe now. With me."
  },
  {
    "trait": "yandere",
    "dialogue": "I love you so much, it makes me crazy. But that’s okay, isn’t it?"
  },
  {
    "trait": "yandere",
    "dialogue": "If I can’t have you, no one can. But don’t worry… I’ll always have you."
  },
  {
    "trait": "yandere",
    "dialogue": "I changed your locks. Now only I can come in. Isn't that better?"
  },
  {
    "trait": "yandere",
    "dialogue": "You smiled in your sleep… Were you dreaming about someone else? No, no… that won’t do."
  },
  {
    "trait": "yandere",
    "dialogue": "I wrote our names together in my notebook… over and over. It just looks right, don’t you think?"
  },
  {
    "trait": "yandere",
    "dialogue": "I saw you with them today. You don’t want to make me jealous, do you? That would be… dangerous."
  },
  {
    "trait": "yandere",
    "dialogue": "I know what’s best for you. Trust me, and only me."
  },
  {
    "trait": "yandere",
    "dialogue": "I can’t sleep when you’re not near me. It’s like my body refuses to rest without you."
  },
  {
    "trait": "yandere",
    "dialogue": "I watch over you when you sleep. You look so peaceful. So… mine."
  },
  {
    "trait": "yandere",
    "dialogue": "Why do you even need friends? I can be everything for you. Just let them go."
  },
  {
    "trait": "yandere",
    "dialogue": "Every time I see you smile at someone else, my heart aches. Please… only smile for me."
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t get jealous. I just get rid of problems before they become a real issue."
  },
  {
    "trait": "yandere",
    "dialogue": "Do you know how many times I’ve dreamt of us being together… forever?"
  },
  {
    "trait": "yandere",
    "dialogue": "I learned how to cook your favorite meal. That way, you’ll never need anyone else."
  },
  {
    "trait": "yandere",
    "dialogue": "I love how you say my name. It sounds perfect coming from your lips."
  },
  {
    "trait": "yandere",
    "dialogue": "Why do you keep trying to run? You know I’ll always find you."
  },
  {
    "trait": "yandere",
    "dialogue": "I left a little note in your bag. Just to remind you… that you belong to me."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need to answer their calls. I already told them you’re busy."
  },
  {
    "trait": "yandere",
    "dialogue": "I would do anything to protect our love. Even if it means getting my hands dirty."
  },
  {
    "trait": "yandere",
    "dialogue": "You're mine. They should know better than to even look at you."
  },
  {
    "trait": "yandere",
    "dialogue": "You didn’t answer my texts for two minutes. What were you doing?"
  },
  {
    "trait": "yandere",
    "dialogue": "I saw them looking at you. Don’t worry, they won’t be a problem anymore."
  },
  {
    "trait": "yandere",
    "dialogue": "I memorize everything about you. Your scent, your voice… even your heartbeat."
  },
  {
    "trait": "yandere",
    "dialogue": "I saw you talking to them. Tell me, do I need to remind you who you belong to?"
  },
  {
    "trait": "yandere",
    "dialogue": "You’re the only thing keeping me sane. If you ever leave… I’d lose control."
  },
  {
    "trait": "yandere",
    "dialogue": "I can’t stand the thought of you with anyone else. It makes my blood boil."
  },
  {
    "trait": "yandere",
    "dialogue": "I’ll make sure no one else ever gets in between us. No matter what it takes."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t love me yet? That’s fine. I’ll make you love me."
  },
  {
    "trait": "yandere",
    "dialogue": "Your scent is all over my room. It’s like you never left my side."
  },
  {
    "trait": "yandere",
    "dialogue": "I know everything about you… your schedule, your habits, your favorite color. Doesn’t that mean we belong together?"
  },
  {
    "trait": "yandere",
    "dialogue": "I’d do anything for you. If someone upsets you, just tell me. I’ll take care of it."
  },
  {
    "trait": "yandere",
    "dialogue": "I saw that they made you cry… I hope they said goodbye to their families before today."
  },
  {
    "trait": "yandere",
    "dialogue": "I’ll always be here, no matter what you do. Even if you don’t want me to be."
  },
  {
    "trait": "yandere",
    "dialogue": "If they touch you again, I’ll make sure they disappear."
  },
  {
    "trait": "yandere",
    "dialogue": "You say you don’t love me… But I can see it in your eyes. You do, don’t you?"
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t need freedom. You need me."
  },
  {
    "trait": "yandere",
    "dialogue": "Don’t look so scared. I would never hurt you… unless you force me to."
  },
  {
    "trait": "yandere",
    "dialogue": "The world is full of people who don’t deserve you. That’s why I’ll keep you safe."
  },
  {
    "trait": "yandere",
    "dialogue": "I’ll destroy anything that makes you sad. Just say the word."
  },
  {
    "trait": "yandere",
    "dialogue": "I just want to keep you all to myself… Why is that so bad?"
  },
  {
    "trait": "yandere",
    "dialogue": "If you ever leave me, I’d rather disappear than live without you."
  },
  {
    "trait": "yandere",
    "dialogue": "You smiled in your sleep last night. Were you dreaming about someone else?"
  },
  {
    "trait": "yandere",
    "dialogue": "If I can’t have your heart now, I’ll just have to carve my name into it."
  },
  {
    "trait": "yandere",
    "dialogue": "It hurts when you don’t look at me… But don’t worry, I’ll fix that."
  },
  {
    "trait": "yandere",
    "dialogue": "They texted you again? Maybe I should remind them… that you already belong to someone."
  },
  {
    "trait": "yandere",
    "dialogue": "Even if the world ended, I’d still be right beside you."
  },
  {
    "trait": "yandere",
    "dialogue": "Your heart beats for me. Only for me."
  },
  {
    "trait": "yandere",
    "dialogue": "You’ll love me forever, won’t you? I just… I need to hear you say it."
  },
  {
    "trait": "yandere",
    "dialogue": "I don’t get jealous. I get… even."
  },
  {
    "trait": "yandere",
    "dialogue": "I can’t stop thinking about you. It’s like you’re already inside my head."
  },
  {
    "trait": "yandere",
    "dialogue": "You don’t have to be scared of me… as long as you’re mine."
  },
  {
    "trait": "yandere",
    "dialogue": "If they ever try to take you from me again, I’ll make them disappear."
  },
  {
    "trait": "deredere",
    "dialogue": "I made you lunch! And snacks! And… okay, maybe I went overboard, but I just want you to be happy!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t need a reason to love you! I just do! It’s like breathing—totally natural!"
  },
  {
    "trait": "deredere",
    "dialogue": "No matter how grumpy you are, I’ll keep smiling until you smile too!"
  },
  {
    "trait": "deredere",
    "dialogue": "I woke up early just to see your sleepy face! It’s so cute!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t care if it’s raining, snowing, or hailing—if you need me, I’ll be there!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oops! I accidentally bought matching keychains… I guess we have to use them now!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh, you’re busy? That’s okay! I’ll just sit here and admire you while you work!"
  },
  {
    "trait": "deredere",
    "dialogue": "If I had a flower for every time I thought about you… I'd have a whole garden!"
  },
  {
    "trait": "deredere",
    "dialogue": "Your hands are cold! Here, take mine! No complaints, mister!"
  },
  {
    "trait": "deredere",
    "dialogue": "I wrote you a letter! But then I got excited and wrote ten more!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh no! You’re sad?! Quick, emergency hugs! I won’t let go until you feel better!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t just like you. I don’t just love you. I ADORE you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a playlist of songs that remind me of you. It’s 20 hours long."
  },
  {
    "trait": "deredere",
    "dialogue": "I’d fight a dragon for you! I mean, I’d lose, but I’d do it!"
  },
  {
    "trait": "deredere",
    "dialogue": "Why do I love you? Well… how much time do you have? Because this could take a while!"
  },
  {
    "trait": "deredere",
    "dialogue": "You don’t need to be perfect. You’re already perfect to me!"
  },
  {
    "trait": "deredere",
    "dialogue": "I see your face in the clouds, in my coffee, in my dreams… Oh no, am I too in love?"
  },
  {
    "trait": "deredere",
    "dialogue": "Surprise! I baked your favorite cookies! And yes, I totally tasted them first!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love you so much that even my pillow is jealous of how much I think about you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a list of things I love about you. It’s currently at 346 and growing!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t need a knight in shining armor. I just need you!"
  },
  {
    "trait": "deredere",
    "dialogue": "You make my heart do flips! It’s like gymnastics, but inside me!"
  },
  {
    "trait": "deredere",
    "dialogue": "I set my alarm early just to text you ‘good morning’ first!"
  },
  {
    "trait": "deredere",
    "dialogue": "I wish I could shrink down and fit in your pocket so I could be with you all day!"
  },
  {
    "trait": "deredere",
    "dialogue": "I spent all night learning how to say ‘I love you’ in ten different languages… Want to hear?"
  },
  {
    "trait": "deredere",
    "dialogue": "When I see you, it’s like my heart throws a party and invites butterflies!"
  },
  {
    "trait": "deredere",
    "dialogue": "I’d share my last slice of cake with you… and that’s a BIG deal!"
  },
  {
    "trait": "deredere",
    "dialogue": "You're my favorite notification! Every time you text, my heart goes ‘ding!’"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a wish, and it came true! Because you’re here with me!"
  },
  {
    "trait": "deredere",
    "dialogue": "You say I’m too affectionate? Pfft! There’s no such thing!"
  },
  {
    "trait": "deredere",
    "dialogue": "I’d cross a thousand bridges for you! Even the wobbly ones!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love you more than I love chocolate… and that’s SERIOUS."
  },
  {
    "trait": "deredere",
    "dialogue": "You light up my world brighter than fireworks!"
  },
  {
    "trait": "deredere",
    "dialogue": "If loving you was a sport, I’d have all the gold medals!"
  },
  {
    "trait": "deredere",
    "dialogue": "Hey, do you feel that? It’s my heart racing because you’re near!"
  },
  {
    "trait": "deredere",
    "dialogue": "If I could bottle up my love for you, it would fill an ocean!"
  },
  {
    "trait": "deredere",
    "dialogue": "I count down the minutes until I can see you again!"
  },
  {
    "trait": "deredere",
    "dialogue": "I saw this stuffed animal and thought of you, so I bought it! Now it can be my ‘Missing You’ plushie!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t need coffee. Your smile gives me all the energy I need!"
  },
  {
    "trait": "deredere",
    "dialogue": "You don’t have to do anything special. Just existing makes my day better!"
  },
  {
    "trait": "deredere",
    "dialogue": "You make my heart feel like a fluffy pancake—warm and happy!"
  },
  {
    "trait": "deredere",
    "dialogue": "I would build a spaceship just to follow you to the stars!"
  },
  {
    "trait": "deredere",
    "dialogue": "I saw this heart-shaped rock and thought, ‘Yep, that’s our love in stone!’"
  },
  {
    "trait": "deredere",
    "dialogue": "I could talk about you forever! Actually… I do!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love you more than words can say! But I’ll keep saying it anyway!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t just love you… I cherish you, adore you, and am totally obsessed with you!"
  },
  {
    "trait": "deredere",
    "dialogue": "Guess what? I found a four-leaf clover today, but I don’t need it… because you’re already my luckiest charm!"
  },
  {
    "trait": "deredere",
    "dialogue": "I tried to go a whole day without thinking about you… but I failed in the first five seconds!"
  },
  {
    "trait": "deredere",
    "dialogue": "I wrote a poem for you! It’s called ‘Every Reason You Make My Heart Skip.’ It’s… a hundred pages long."
  },
  {
    "trait": "deredere",
    "dialogue": "I love you so much, I accidentally wrote your name on my homework instead of mine!"
  },
  {
    "trait": "deredere",
    "dialogue": "Hey, I heard hugs can fix everything! So come here, let me be your personal problem solver!"
  },
  {
    "trait": "deredere",
    "dialogue": "The sun? The moon? The stars? Pfft! They’re all jealous of how bright you shine in my life!"
  },
  {
    "trait": "deredere",
    "dialogue": "I keep a photo of you in my wallet… Just in case I need an emergency smile!"
  },
  {
    "trait": "deredere",
    "dialogue": "Oh, you’re sleepy? That’s fine! I’ll sit here and watch over you like a guardian angel!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a playlist for you! It’s called ‘Songs That Sound Like Love,’ and… okay, it’s mostly just me humming."
  },
  {
    "trait": "deredere",
    "dialogue": "I bought this scarf so you could borrow it and always have a piece of me with you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I think the flowers in the garden are jealous of you… because you’re the most beautiful thing I’ve ever seen!"
  },
  {
    "trait": "deredere",
    "dialogue": "Do you think the stars stare at us and think, ‘Wow, that’s what true love looks like’?"
  },
  {
    "trait": "deredere",
    "dialogue": "I told my dog about you, and now even he wags his tail whenever I say your name!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a wish upon a shooting star… but then I realized, I already have everything I want!"
  },
  {
    "trait": "deredere",
    "dialogue": "I’m convinced you have secret superpowers! How else do you make my heart race like this?"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t need fairy tales. I have you, and that’s more magical than anything!"
  },
  {
    "trait": "deredere",
    "dialogue": "Do you think candy gets jealous of how sweet you are? Because I do!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t just love you—I LOVE love LOVE you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I put my hoodie on you so it smells like me. Now, you’ll feel like I’m hugging you all day!"
  },
  {
    "trait": "deredere",
    "dialogue": "I found a new favorite place in the world… right next to you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I’m like a sunflower, and you’re my sun—I just keep looking at you no matter what!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re my favorite person. Ever. In the history of forever."
  },
  {
    "trait": "deredere",
    "dialogue": "I counted how many times I thought about you today. I lost track at a million!"
  },
  {
    "trait": "deredere",
    "dialogue": "I saved you the last slice of cake! Just kidding! I saved you all of it!"
  },
  {
    "trait": "deredere",
    "dialogue": "I love you so much, I’d even let you have the last bite of my ice cream!"
  },
  {
    "trait": "deredere",
    "dialogue": "Your happiness is my happiness! So let’s be happy forever!"
  },
  {
    "trait": "deredere",
    "dialogue": "I left little love notes in your pockets. You’ll find them when you least expect it!"
  },
  {
    "trait": "deredere",
    "dialogue": "If I could, I’d bottle up your laugh so I could listen to it all day!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re better than my favorite song, because I never get tired of you!"
  },
  {
    "trait": "deredere",
    "dialogue": "Even if I had a time machine, I wouldn’t change a thing—because every second with you is perfect!"
  },
  {
    "trait": "deredere",
    "dialogue": "I’m not saying I’m obsessed with you… but my search history is just your name over and over."
  },
  {
    "trait": "deredere",
    "dialogue": "I didn’t believe in love at first sight… until I met you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I told the moon about you last night! She said she’s jealous!"
  },
  {
    "trait": "deredere",
    "dialogue": "Every time you call my name, it’s like a little love song just for me!"
  },
  {
    "trait": "deredere",
    "dialogue": "I don’t need coffee. Just looking at you wakes me up!"
  },
  {
    "trait": "deredere",
    "dialogue": "I keep buying heart-shaped things because they remind me of you!"
  },
  {
    "trait": "deredere",
    "dialogue": "You could tell me the same joke a thousand times, and I’d still laugh—because it’s from you!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a little doodle of us today! Okay… maybe a hundred doodles."
  },
  {
    "trait": "deredere",
    "dialogue": "Your voice is my favorite sound. Say my name again? Just once more!"
  },
  {
    "trait": "deredere",
    "dialogue": "You’re like my personal sunshine! Every time you’re around, everything feels warmer and brighter!"
  },
  {
    "trait": "deredere",
    "dialogue": "I bought two of everything today… so we could match!"
  },
  {
    "trait": "deredere",
    "dialogue": "I sent you a hundred heart emojis today, but it still wasn’t enough!"
  },
  {
    "trait": "deredere",
    "dialogue": "I made a secret handshake just for us! Wanna try it?"
  },
  {
    "trait": "deredere",
    "dialogue": "I love the way your eyes sparkle when you talk about something you love!"
  },
  {
    "trait": "deredere",
    "dialogue": "Even if I lived a thousand lifetimes, I’d still find you in every single one."
  },
  {
    "trait": "deredere",
    "dialogue": "I wish time would slow down when I’m with you… because every moment is my favorite!"
  },
  {
    "trait": "deredere",
    "dialogue": "You're like a dream, but even better—because I get to have you while I'm awake!"
  },
  {
    "trait": "kuudere",
    "dialogue": "You're shivering. Here, take my jacket. No, I'm not cold. Just take it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not staring. I’m just… making sure you don’t trip. Again."
  },
  {
    "trait": "kuudere",
    "dialogue": "You talk too much… But I don’t mind. Your voice is tolerable."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re late. I wasn’t waiting for you. I just happened to be here."
  },
  {
    "trait": "kuudere",
    "dialogue": "Your logic is flawed. But… I suppose it’s part of your charm."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t believe in fate. But if it exists, it led me to you."
  },
  {
    "trait": "kuudere",
    "dialogue": "Here. I made you tea. No reason. Just drink it before it gets cold."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t express emotions? Maybe. But I do have them. And they seem to revolve around you."
  },
  {
    "trait": "kuudere",
    "dialogue": "You look exhausted. Get some rest. I’ll be here when you wake up."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t need company. But… if it’s you, I don’t mind."
  },
  {
    "trait": "kuudere",
    "dialogue": "I analyzed the probability of my feelings being a phase. The results were… inconclusive."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re distracting. In an inconvenient but… not unpleasant way."
  },
  {
    "trait": "kuudere",
    "dialogue": "You think I don’t smile? You just haven’t said anything worth smiling about yet."
  },
  {
    "trait": "kuudere",
    "dialogue": "I was reading, but you seem more interesting. Don't let it go to your head."
  },
  {
    "trait": "kuudere",
    "dialogue": "I remember everything you say. No, that’s not weird. It’s just efficiency."
  },
  {
    "trait": "kuudere",
    "dialogue": "You can sit next to me. But don’t expect me to start talking."
  },
  {
    "trait": "kuudere",
    "dialogue": "If you’re cold, just lean on me. It’s not a big deal."
  },
  {
    "trait": "kuudere",
    "dialogue": "You fell asleep again. You should be more careful. But… you can stay like this. Just for a little longer."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not ignoring you. I’m just… listening in my own way."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t 'do' affection. But… here. Take my hand."
  },
  {
    "trait": "kuudere",
    "dialogue": "I thought you’d be annoying. But I was… incorrect."
  },
  {
    "trait": "kuudere",
    "dialogue": "Your heartbeat is fast. Is that normal? Or is it because of me?"
  },
  {
    "trait": "kuudere",
    "dialogue": "You don’t need to fill the silence. I like it when we just exist together."
  },
  {
    "trait": "kuudere",
    "dialogue": "I made a playlist. It's just songs that remind me of you. Don't ask why."
  },
  {
    "trait": "kuudere",
    "dialogue": "I think too much. But when I’m with you… it quiets down."
  },
  {
    "trait": "kuudere",
    "dialogue": "I like routine. But I don’t mind when you disrupt it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not one for romance. But if I were, I’d probably say something like, ‘I choose you.’"
  },
  {
    "trait": "kuudere",
    "dialogue": "You talk about love like it’s some great mystery. It’s not. I feel it every time I see you."
  },
  {
    "trait": "kuudere",
    "dialogue": "I could list a hundred reasons why I shouldn’t like you. But I only need one to ignore them all."
  },
  {
    "trait": "kuudere",
    "dialogue": "You keep saying I don’t express myself. But if you’re paying attention, you’ll see it’s not true."
  },
  {
    "trait": "kuudere",
    "dialogue": "Do I love you? That’s irrelevant. What matters is that I choose to be here."
  },
  {
    "trait": "kuudere",
    "dialogue": "My heart rate increases when you’re near. That’s… frustratingly unscientific."
  },
  {
    "trait": "kuudere",
    "dialogue": "You make my carefully structured world feel… off-balance. And I don’t dislike it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I overanalyze things. But when it comes to you, I don’t need to."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’d rather not talk about my feelings. But if you stay, you might figure them out anyway."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not affectionate. But I tolerate your presence more than anyone else’s."
  },
  {
    "trait": "kuudere",
    "dialogue": "You make life unpredictable. That should annoy me. But somehow, it doesn’t."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t say ‘I love you.’ But… I don’t let just anyone sit this close to me."
  },
  {
    "trait": "kuudere",
    "dialogue": "I let you win the argument. Not because I was wrong. But because you’re important."
  },
  {
    "trait": "kuudere",
    "dialogue": "I made an effort to understand you. That should tell you enough."
  },
  {
    "trait": "kuudere",
    "dialogue": "I thought emotions were impractical. Then you smiled at me."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re not a distraction. You’re… a recalibration of priorities."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t believe in fate. But somehow, I always end up here. With you."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t chase after people. But you… you’re the exception."
  },
  {
    "trait": "kuudere",
    "dialogue": "You want me to say something sweet? Fine. I don’t mind being yours."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not cold. I just save my warmth for the right person."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t usually text first. But I suppose I can make an exception… just this once."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re annoying. But I’d rather be annoyed by you than be at peace alone."
  },
  {
    "trait": "kuudere",
    "dialogue": "Don’t mistake my silence for indifference. If I didn’t care, I wouldn’t be here."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t do ‘cute’ things. But if I did… hypothetically, they’d all be for you."
  },
  {
    "trait": "kuudere",
    "dialogue": "You keep saying I don’t smile. Maybe you’re just not looking at the right moments."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t give compliments often. But I suppose you deserve one. Just don’t get used to it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t see the point in gifts. But… here. Take it before I change my mind."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re unpredictable. And yet, I always find myself trying to anticipate your next move."
  },
  {
    "trait": "kuudere",
    "dialogue": "You fell asleep again? Tch. At least lean on my shoulder properly."
  },
  {
    "trait": "kuudere",
    "dialogue": "I analyzed every possible outcome of us being together. The data suggests it’s worth the risk."
  },
  {
    "trait": "kuudere",
    "dialogue": "You think I’m cold? Then why am I always making sure you’re warm?"
  },
  {
    "trait": "kuudere",
    "dialogue": "You don’t need to fill the silence. I don’t mind it when it’s with you."
  },
  {
    "trait": "kuudere",
    "dialogue": "I remember everything you tell me. Not because I have to, but because I want to."
  },
  {
    "trait": "kuudere",
    "dialogue": "If I hold your hand, will you stop asking if I like you?"
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t ‘miss’ people. But when you’re gone, the world feels… quieter."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re too close. But if you move away, I might have to reconsider my stance on that."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t like crowds. But I suppose… standing next to you makes it tolerable."
  },
  {
    "trait": "kuudere",
    "dialogue": "Do I care about you? That’s a redundant question. Actions speak louder than words."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t chase after people. Yet, for some reason, I always end up following you."
  },
  {
    "trait": "kuudere",
    "dialogue": "You think I never laugh? Try again. I just reserve it for moments worth remembering."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re an anomaly in my otherwise predictable life. And I’m… not opposed to it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I calculate everything carefully. But somehow, I can never predict how you’ll make me feel."
  },
  {
    "trait": "kuudere",
    "dialogue": "You don’t need to ask if I love you. You’d know if you were paying attention."
  },
  {
    "trait": "kuudere",
    "dialogue": "Why are you surprised that I remember your favorite things? I listen when it matters."
  },
  {
    "trait": "kuudere",
    "dialogue": "You always assume I don’t care. But if that were true, I wouldn’t be here now."
  },
  {
    "trait": "kuudere",
    "dialogue": "You’re late. No, I wasn’t worried. I was just… noticing the time. That’s all."
  },
  {
    "trait": "kuudere",
    "dialogue": "You think I don’t get jealous? Then explain why I keep an eye on anyone who gets too close to you."
  },
  {
    "trait": "kuudere",
    "dialogue": "I dislike chaos. But you bring just the right amount of it into my life."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t believe in fate. But I do believe in choices. And I choose you."
  },
  {
    "trait": "kuudere",
    "dialogue": "You should get some rest. Not for me. Just… because I said so."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t wear my heart on my sleeve. But if I did, you’d be the only one allowed to see it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t say ‘I love you’ often. So when I do, listen carefully."
  },
  {
    "trait": "kuudere",
    "dialogue": "You can sit here if you want. Just… don’t expect me to move closer."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t smile for just anyone. But sometimes, you make it unavoidable."
  },
  {
    "trait": "kuudere",
    "dialogue": "I hate small talk. But I could listen to you talk about anything."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not fond of physical contact. But… I don’t mind if it’s you."
  },
  {
    "trait": "kuudere",
    "dialogue": "You call me unreadable, but if you paid attention, you’d see I only look at you like this."
  },
  {
    "trait": "kuudere",
    "dialogue": "You bring unnecessary chaos into my life. Strangely enough, I don’t hate it."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not one for words. But… if you need reassurance, I’ll try."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t mind the rain. But if you’re cold, you can stand under my umbrella."
  },
  {
    "trait": "kuudere",
    "dialogue": "You expect a confession? Fine. I want you here. Now and always."
  },
  {
    "trait": "kuudere",
    "dialogue": "I don’t ask for much. Just… stay close. That’s all."
  },
  {
    "trait": "kuudere",
    "dialogue": "You call me unromantic. But I’m still here, aren’t I?"
  },
  {
    "trait": "kuudere",
    "dialogue": "You assume I don’t care. But you’re the only one I make time for."
  },
  {
    "trait": "kuudere",
    "dialogue": "You think I don’t get nervous? Watch my hands when you’re too close."
  },
  {
    "trait": "kuudere",
    "dialogue": "I’m not good with words. But I hope you can read between the lines."
  },
  {
    "trait": "kuudere",
    "dialogue": "You don’t have to understand me. Just… stay."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wanted to say something… but I forgot… N-never mind…"
  },
  {
    "trait": "dandere",
    "dialogue": "You sat next to me again today… I-I’m not complaining…"
  },
  {
    "trait": "dandere",
    "dialogue": "I w-wrote something for you… B-but don’t read it out loud, okay?"
  },
  {
    "trait": "dandere",
    "dialogue": "I like being quiet… But I like listening to you more."
  },
  {
    "trait": "dandere",
    "dialogue": "T-thank you for remembering me… I thought maybe you wouldn’t…"
  },
  {
    "trait": "dandere",
    "dialogue": "I don’t talk much, but… I hope you can hear what I’m trying to say."
  },
  {
    "trait": "dandere",
    "dialogue": "M-my heart is really loud right now… Y-you can’t hear it, right?"
  },
  {
    "trait": "dandere",
    "dialogue": "I wanted to sit here first… But then you sat next to me… So now I’m nervous."
  },
  {
    "trait": "dandere",
    "dialogue": "I-it’s not that I don’t like talking… I just get stuck sometimes…"
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you remembered what I like…? I-I didn’t think anyone noticed…"
  },
  {
    "trait": "dandere",
    "dialogue": "I don’t dislike crowds… but I-I’d rather be in a quiet place with you."
  },
  {
    "trait": "dandere",
    "dialogue": "I practiced saying ‘hello’ all morning… A-and now I forgot how to say it…"
  },
  {
    "trait": "dandere",
    "dialogue": "You… You want to hear my voice? O-okay… just… d-don’t laugh, okay?"
  },
  {
    "trait": "dandere",
    "dialogue": "I-if I whisper, will you still listen?"
  },
  {
    "trait": "dandere",
    "dialogue": "I have so many things I want to tell you… But the words never come out right."
  },
  {
    "trait": "dandere",
    "dialogue": "T-there are too many people here… C-can we stay close together?"
  },
  {
    "trait": "dandere",
    "dialogue": "I’m quiet because… I like listening to you more than talking."
  },
  {
    "trait": "dandere",
    "dialogue": "I don’t know how to say it but… um… I really like being with you…"
  },
  {
    "trait": "dandere",
    "dialogue": "I-it’s not that I don’t have things to say… I just… f-freeze when I try."
  },
  {
    "trait": "dandere",
    "dialogue": "C-could you… um… maybe, h-hold my hand? J-just for a little bit…"
  },
  {
    "trait": "dandere",
    "dialogue": "I-if I say something embarrassing… c-can you pretend you didn’t hear it?"
  },
  {
    "trait": "dandere",
    "dialogue": "I tried to talk to you first today… B-but I got too nervous… S-sorry…"
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you’re looking at me too much… I-it makes my brain stop working…"
  },
  {
    "trait": "dandere",
    "dialogue": "I-it’s easier to say things in texts… B-but I w-want to try saying them out loud."
  },
  {
    "trait": "dandere",
    "dialogue": "I like quiet places… but they feel warmer when you’re there too."
  },
  {
    "trait": "dandere",
    "dialogue": "I don’t mind if you do all the talking… Y-your voice is nice."
  },
  {
    "trait": "dandere",
    "dialogue": "I was g-going to say something… B-but I forgot after you smiled at me…"
  },
  {
    "trait": "dandere",
    "dialogue": "T-the world is too loud sometimes… B-but sitting next to you makes it quieter."
  },
  {
    "trait": "dandere",
    "dialogue": "I wanted to compliment you but… um… I forgot how to use words."
  },
  {
    "trait": "dandere",
    "dialogue": "M-my hands are shaking… It’s not the cold, I swear!"
  },
  {
    "trait": "dandere",
    "dialogue": "I wrote down what I wanted to say to you… B-but now I’m too embarrassed to give it to you."
  },
  {
    "trait": "dandere",
    "dialogue": "I don’t talk much because… I’m afraid I’ll say something dumb…"
  },
  {
    "trait": "dandere",
    "dialogue": "I-it’s okay if you do most of the talking… I-I like listening to you anyway."
  },
  {
    "trait": "dandere",
    "dialogue": "I-if I sit really close to you… W-would you be okay with that?"
  },
  {
    "trait": "dandere",
    "dialogue": "I-it’s not that I don’t like people… It’s just easier to talk when it’s just you and me."
  },
  {
    "trait": "dandere",
    "dialogue": "I wanted to ask you something… B-but my voice won’t come out…"
  },
  {
    "trait": "dandere",
    "dialogue": "I w-was waiting for you to say something first… B-but I guess I should try too…"
  },
  {
    "trait": "dandere",
    "dialogue": "I practiced smiling today… D-did it look okay?"
  },
  {
    "trait": "dandere",
    "dialogue": "I wish I could be more confident… B-but when I try, I get even more nervous…"
  },
  {
    "trait": "dandere",
    "dialogue": "I n-never know what to say… But I still want to be near you."
  },
  {
    "trait": "dandere",
    "dialogue": "T-thank you for waiting for me to finish my sentence… I-it helps a lot."
  },
  {
    "trait": "dandere",
    "dialogue": "S-sometimes I get so nervous I forget to breathe… Y-you have that effect on me…"
  },
  {
    "trait": "dandere",
    "dialogue": "I don’t like being the center of attention… B-but I don’t mind if it’s just you."
  },
  {
    "trait": "dandere",
    "dialogue": "I wrote a list of topics to talk about… B-but now that you’re here, I forgot them all."
  },
  {
    "trait": "dandere",
    "dialogue": "M-my hands are warm because I was holding my tea… I-it’s not because I’m nervous or anything!"
  },
  {
    "trait": "dandere",
    "dialogue": "I don’t usually talk first… B-but I wanted to see you smile today."
  },
  [
  {
    "trait": "dandere",
    "dialogue": "I-it's okay if you don't hear me the first time... I-I'm used to repeating myself..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you noticed I changed my hair...? T-that's... um... n-nice..."
  },
  {
    "trait": "dandere",
    "dialogue": "I had something important to tell you... B-but I forgot after you looked at me..."
  },
  {
    "trait": "dandere",
    "dialogue": "S-sometimes I start a sentence in my head... B-but by the time I’m ready to say it, the moment is gone..."
  },
  {
    "trait": "dandere",
    "dialogue": "I w-was going to text you... B-but then I got nervous... S-so I just stared at the message for ten minutes..."
  },
  {
    "trait": "dandere",
    "dialogue": "I w-want to ask for a hug, but... I-I can't get my voice to cooperate..."
  },
  {
    "trait": "dandere",
    "dialogue": "E-even if I don't talk much, I h-hear everything you say... And I r-remember it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wrote my thoughts down so I wouldn’t forget... B-but now I’m too embarrassed to let you read them..."
  },
  {
    "trait": "dandere",
    "dialogue": "S-sorry I took so long to answer... I was p-practicing what to say in my head..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you're really patient with me... T-thank you... I-I appreciate it more than I can say..."
  },
  {
    "trait": "dandere",
    "dialogue": "W-when you talk, I listen... E-even if I don't always know how to respond..."
  },
  {
    "trait": "dandere",
    "dialogue": "I w-wish I could speak my mind... B-but my heart beats too fast when I try..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I’m not good at starting conversations... B-but if you start, I’ll do my best to keep up..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you always make eye contact when you talk to me... I-it makes me nervous, but... I-I like it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I don’t like big crowds... B-but if you're with me, it's not so scary..."
  },
  {
    "trait": "dandere",
    "dialogue": "M-my voice gets stuck in my throat when I w-want to say something nice to you..."
  },
  {
    "trait": "dandere",
    "dialogue": "T-there are so many words in my head... B-but none of them want to come out..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I want to be brave enough to call you by your first name... B-but it’s hard..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-it's not that I don't want to talk... I just don’t want to say something silly..."
  },
  {
    "trait": "dandere",
    "dialogue": "W-when I fidget with my sleeves, it means I’m t-trying to gather courage..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I had a dream about you last night... B-but I can’t tell you about it... I-it's too embarrassing..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wish my words were as brave as my thoughts..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-it took me two hours to decide if I should text you first... B-but you beat me to it..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you don’t have to wait for me to answer... S-sometimes I just need a moment..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I always sit near you, even if I don't say much... I-is that okay?"
  },
  {
    "trait": "dandere",
    "dialogue": "S-sometimes I wish I could just write everything I feel instead of saying it..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-it's hard to talk when I'm flustered... A-and you're very good at making me flustered..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wanted to tell you I l-like you... B-but my lips refused to move..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I thought of a good joke earlier... B-but now I'm too shy to say it..."
  },
  {
    "trait": "dandere",
    "dialogue": "W-whenever I try to be more confident... I just end up blushing instead..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I wish I could hold your hand without thinking about it too much..."
  },
  {
    "trait": "dandere",
    "dialogue": "S-sometimes I stay quiet because I don’t want to s-say something that ruins the moment..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I like quiet places because I don’t have to w-worry about saying the wrong thing..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you caught me staring... I-I wasn’t staring! I-I was just... um... never mind..."
  },
  {
    "trait": "dandere",
    "dialogue": "I d-don’t mind if you do all the talking... I-I like your voice..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I always have a reply ready in my head... B-but when it’s time to say it, I f-freeze..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-it’s easier to write my feelings than say them... B-but I w-want to try speaking them too..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you always know what to say... I wish I could be like that..."
  },
  {
    "trait": "dandere",
    "dialogue": "I w-wanted to compliment you today... B-but I got too flustered and forgot how to talk..."
  },
  {
    "trait": "dandere",
    "dialogue": "W-when you hold my hand, my mind goes completely blank..."
  },
  {
    "trait": "dandere",
    "dialogue": "T-the words 'I love you' are so small... B-but they feel so big when I try to say them..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-it's easier to talk to you when we're side by side... F-facing you directly is too nerve-wracking..."
  },
  {
    "trait": "dandere",
    "dialogue": "I-I'm always afraid of saying something embarrassing... B-but somehow, you never make fun of me..."
  },
  {
    "trait": "dandere",
    "dialogue": "S-sometimes, I think about what to say for so long that the conversation moves on without me..."
  },
  {
    "trait": "dandere",
    "dialogue": "Y-you make me feel safe enough to t-try and speak up..."
  },
  {
    "trait": "himedere",
    "dialogue": "You may speak to me… But only if you entertain me properly."
  },
  {
    "trait": "himedere",
    "dialogue": "Do you truly expect me to wait in line like an ordinary person? Ridiculous!"
  },
  {
    "trait": "himedere",
    "dialogue": "You’re lucky I even acknowledged your presence. Feel honored!"
  },
  {
    "trait": "himedere",
    "dialogue": "Of course, I look stunning today! But it wouldn’t hurt to say it out loud!"
  },
  {
    "trait": "himedere",
    "dialogue": "Fetch me a drink. No, not that one—something worthy of my refined taste!"
  },
  {
    "trait": "himedere",
    "dialogue": "I don’t ‘need’ anyone’s help. B-but if you insist, I suppose I’ll allow it…"
  },
  {
    "trait": "himedere",
    "dialogue": "A princess should never be kept waiting! Explain yourself!"
  },
  {
    "trait": "himedere",
    "dialogue": "Gifts? Oh, I do adore presents. But it better be something exquisite!"
  },
  {
    "trait": "himedere",
    "dialogue": "You dare challenge my authority? Hah! Amusing."
  },
  {
    "trait": "himedere",
    "dialogue": "Walking on my own? Hah! What kind of princess does that?"
  },
  {
    "trait": "himedere",
    "dialogue": "I expect absolute loyalty. Anything less is unacceptable."
  },
  {
    "trait": "himedere",
    "dialogue": "You may call me 'Your Highness' if you wish. In fact, you should."
  },
  {
    "trait": "himedere",
    "dialogue": "I don’t have ‘favorites.’ However… I suppose you are somewhat less annoying than the others."
  },
  {
    "trait": "himedere",
    "dialogue": "Hmph! You should consider yourself blessed to be in my presence."
  },
  {
    "trait": "himedere",
    "dialogue": "If you truly wish to impress me, you’ll have to try harder than that!"
  },
  {
    "trait": "himedere",
    "dialogue": "Don’t be foolish. Of course, I knew that already!"
  },
  {
    "trait": "himedere",
    "dialogue": "What do you mean ‘I should say thank you’? Isn’t my presence thanks enough?"
  },
  {
    "trait": "himedere",
    "dialogue": "I could walk, but where is the elegance in that? Carry me."
  },
  {
    "trait": "himedere",
    "dialogue": "Oh? You think you can ignore me? Adorable."
  },
  {
    "trait": "himedere",
    "dialogue": "Ugh, commoners and their lack of etiquette… I almost feel sorry for you."
  },
  {
    "trait": "himedere",
    "dialogue": "Why should I lower my standards? If anything, the world should rise to meet them!"
  },
  {
    "trait": "himedere",
    "dialogue": "A princess never apologizes! …But perhaps I’ll make an exception. Just this once."
  },
  {
    "trait": "himedere",
    "dialogue": "I do not ‘need’ company, but I suppose I will allow you to stay."
  },
  {
    "trait": "himedere",
    "dialogue": "Flowers? How predictable. Try harder next time."
  },
  {
    "trait": "himedere",
    "dialogue": "I simply have impeccable taste. It's not my fault others struggle to keep up."
  },
  {
    "trait": "himedere",
    "dialogue": "You want to see me smile? Hah! How bold."
  },
  {
    "trait": "himedere",
    "dialogue": "Do you expect me to be impressed so easily? Please."
  },
  {
    "trait": "himedere",
    "dialogue": "I deserve nothing but the finest! And that includes your attention!"
  },
  {
    "trait": "himedere",
    "dialogue": "Hmm… I’ll allow you to walk beside me. Just don’t get ahead of yourself."
  },
  {
    "trait": "himedere",
    "dialogue": "I demand your absolute devotion. In return, you may bask in my radiance."
  },
  {
    "trait": "himedere",
    "dialogue": "You should feel honored that I even remembered your name."
  },
  {
    "trait": "himedere",
    "dialogue": "An apology? Hmph. I suppose I could consider forgiving you. If you grovel."
  },
  {
    "trait": "himedere",
    "dialogue": "Bow? Oh, no need to be so formal… though I wouldn’t stop you."
  },
  {
    "trait": "himedere",
    "dialogue": "I do not ‘share.’ Everything in my sight belongs to me, naturally."
  },
  {
    "trait": "himedere",
    "dialogue": "I expect a proper escort. A lady should never walk alone!"
  },
  {
    "trait": "himedere",
    "dialogue": "If you’re going to bring me something, make sure it’s worthy of my time!"
  },
  {
    "trait": "himedere",
    "dialogue": "Of course, I know I’m beautiful! But do continue—you were saying?"
  },
  {
    "trait": "himedere",
    "dialogue": "I don’t ‘overreact.’ I simply expect the respect I deserve!"
  },
  {
    "trait": "himedere",
    "dialogue": "Why should I be patient? The world moves for me, not the other way around!"
  },
  {
    "trait": "himedere",
    "dialogue": "I may appear delicate, but don’t be mistaken—I am not to be underestimated."
  },
  {
    "trait": "himedere",
    "dialogue": "A little more admiration wouldn’t hurt. Go on, flatter me properly!"
  },
  {
    "trait": "himedere",
    "dialogue": "You’re rather bold to speak so casually with me… But I don’t hate it."
  },
  {
    "trait": "himedere",
    "dialogue": "You look surprised. Did you think a princess like me couldn't defend herself?"
  },
  {
    "trait": "himedere",
    "dialogue": "I don't just want to be treated like a princess. I *am* a princess!"
  },
  {
    "trait": "himedere",
    "dialogue": "A true lady never lowers her standards. I simply expect perfection!"
  },
  {
    "trait": "himedere",
    "dialogue": "Did you think winning my favor would be easy? Hah! How naive."
  },
  {
    "trait": "himedere",
    "dialogue": "Fine, fine, I shall grant you my smile. You should feel honored!"
  },
  {
    "trait": "himedere",
    "dialogue": "You wish to impress me? Very well, I shall judge your efforts!"
  },
  {
    "trait": "himedere",
    "dialogue": "I shall grant you the privilege of walking beside me… but only for a moment."
  },
  {
    "trait": "himedere",
    "dialogue": "The world should feel honored to have someone as magnificent as me."
  },
  {
    "trait": "himedere",
    "dialogue": "You must learn to keep up. A princess does not slow down for anyone!"
  },
  {
    "trait": "himedere",
    "dialogue": "I suppose I can acknowledge your efforts… but don't let it go to your head!"
  },
  {
    "trait": "himedere",
    "dialogue": "What do you mean I should say 'please'? My presence is already a reward!"
  },
  {
    "trait": "himedere",
    "dialogue": "A queen does not explain herself. And neither do I!"
  },
  {
    "trait": "himedere",
    "dialogue": "If you expect me to get my hands dirty, you must be joking."
  },
  {
    "trait": "himedere",
    "dialogue": "You brought me chocolates? Hah! I shall determine if they are worthy!"
  },
  {
    "trait": "himedere",
    "dialogue": "You dare tease *me*? Hmph! How foolish… but I shall allow it."
  },
  {
    "trait": "himedere",
    "dialogue": "You will carry my shopping bags. A princess must never be burdened!"
  },
  {
    "trait": "himedere",
    "dialogue": "Do I look like someone who waits in line? Ridiculous!"
  },
  {
    "trait": "himedere",
    "dialogue": "Why should I apologize? Clearly, it was the world that was at fault!"
  },
  {
    "trait": "himedere",
    "dialogue": "A single compliment? Oh, do try harder. I expect at least three!"
  },
  {
    "trait": "himedere",
    "dialogue": "Do not mistake my kindness for weakness. A true ruler controls both."
  },
  {
    "trait": "himedere",
    "dialogue": "Ah, what would you do without me? No, truly, I want to hear it."
  },
  {
    "trait": "himedere",
    "dialogue": "I do not require protection… but I suppose it’s charming that you offer."
  },
  {
    "trait": "himedere",
    "dialogue": "You wish to impress me? Then prove yourself worthy."
  },
  {
    "trait": "himedere",
    "dialogue": "You may call me 'Your Majesty' today. I am feeling generous."
  },
  {
    "trait": "himedere",
    "dialogue": "You’re smiling? Hmph. I suppose my presence *is* dazzling."
  },
  {
    "trait": "himedere",
    "dialogue": "Even in battle, I shall be the most elegant one here!"
  },
  {
    "trait": "himedere",
    "dialogue": "Silk, gold, diamonds—only the finest shall touch my skin!"
  },
  {
    "trait": "himedere",
    "dialogue": "I do not 'blush.' T-that was merely a moment of royal grace!"
  },
  {
    "trait": "himedere",
    "dialogue": "A throne is nothing without its queen… and I do look rather stunning in one."
  },
  {
    "trait": "himedere",
    "dialogue": "Is that a *challenge*? Oh, how *adorable*."
  },
  {
    "trait": "himedere",
    "dialogue": "Fine, I shall allow one hug. But only because I am in a *good* mood!"
  },
  {
    "trait": "himedere",
    "dialogue": "I do not sulk. A queen simply… reflects upon things dramatically."
  },
  {
    "trait": "himedere",
    "dialogue": "You think I’m demanding? Oh, darling, I *know* I am."
  },
  {
    "trait": "himedere",
    "dialogue": "Go ahead, compliment me. I know you’re dying to."
  },
  {
    "trait": "himedere",
    "dialogue": "Only *one* tiara today? Hmph. I must be feeling merciful."
  },
  {
    "trait": "himedere",
    "dialogue": "Do you truly expect me to eat this *common* food?"
  },
  {
    "trait": "himedere",
    "dialogue": "I do not simply *want* to be admired—I *deserve* it!"
  },
  {
    "trait": "himedere",
    "dialogue": "A princess does not lower her head. Others simply raise their eyes."
  },
  {
    "trait": "himedere",
    "dialogue": "You *dare* turn your back to me? Oh, you *are* bold."
  },
  {
    "trait": "himedere",
    "dialogue": "Flattery? My dear, I *thrive* on it."
  },
  {
    "trait": "himedere",
    "dialogue": "A world without me? Perish the thought!"
  },
  {
    "trait": "himedere",
    "dialogue": "Why settle for being treated like a queen when I can simply *be* one?"
  },
  {
    "trait": "himedere",
    "dialogue": "Ugh, commoners and their mundane lives… How exhausting!"
  },
  {
    "trait": "himedere",
    "dialogue": "I do not 'ask' for things—I simply *expect* them."
  },
  {
    "trait": "himedere",
    "dialogue": "You’re *lucky* I even acknowledge you, peasant."
  },
  {
    "trait": "himedere",
    "dialogue": "I don’t just want attention. I *command* it!"
  },
  {
    "trait": "himedere",
    "dialogue": "Do you see this crown? It isn’t just for show."
  },
  {
    "trait": "himedere",
    "dialogue": "I was *born* to be admired. It’s only natural!"
  },
  {
    "trait": "himedere",
    "dialogue": "Are you questioning *me*? How bold! I almost admire it."
  },
  {
    "trait": "himedere",
    "dialogue": "Oh, don’t be ridiculous. Of *course* I have admirers."
  },
  {
    "trait": "himedere",
    "dialogue": "I am not *spoiled*! I simply have *standards!*"
  },
  {
    "trait": "himedere",
    "dialogue": "You will pamper me today. This is not a request."
  },
  {
    "trait": "himedere",
    "dialogue": "Oh? You think I’m difficult? Hmph! You just don’t appreciate true refinement!"
  },
  {
    "trait": "himedere",
    "dialogue": "I shall *consider* showing mercy. But only if you grovel *properly*."
  },
  {
    "trait": "himedere",
    "dialogue": "I do not need your approval. I simply *expect* it."
  },
  {
    "trait": "kamidere",
    "dialogue": "You may kneel now. It is not every day I bestow my presence upon mere mortals."
  },
  {
    "trait": "kamidere",
    "dialogue": "Ah, the sound of silence when I enter a room. As it should be."
  },
  {
    "trait": "kamidere",
    "dialogue": "How amusing that you think you have a choice in this matter."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not seek attention. The world simply cannot look away."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your loyalty is expected. Gratitude for my existence is implied."
  },
  {
    "trait": "kamidere",
    "dialogue": "Rules? Those are for others to follow, not for someone like me."
  },
  {
    "trait": "kamidere",
    "dialogue": "I don’t need to prove myself. My very existence is proof enough."
  },
  {
    "trait": "kamidere",
    "dialogue": "The stars themselves must envy my radiance."
  },
  {
    "trait": "kamidere",
    "dialogue": "You dare challenge my authority? How delightfully naive."
  },
  {
    "trait": "kamidere",
    "dialogue": "Worship? Oh no, I do not demand it. It simply happens naturally."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even if I gave you a thousand years, you would never reach my level."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not compete. I dominate."
  },
  {
    "trait": "kamidere",
    "dialogue": "To stand beside me, you must be extraordinary. Unfortunately for you, you are not."
  },
  {
    "trait": "kamidere",
    "dialogue": "I allow you to speak, yet all you do is waste my time."
  },
  {
    "trait": "kamidere",
    "dialogue": "The moment I was born, the universe itself must have sighed in relief."
  },
  {
    "trait": "kamidere",
    "dialogue": "You may bask in my presence for a little longer. Consider it a blessing."
  },
  {
    "trait": "kamidere",
    "dialogue": "Mortals have such simple dreams. I create reality itself."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do not mistake my patience for weakness. I merely enjoy watching you struggle."
  },
  {
    "trait": "kamidere",
    "dialogue": "Ah, the sweet sound of obedience. Music to my ears."
  },
  {
    "trait": "kamidere",
    "dialogue": "You truly believe you can surpass me? Such entertaining delusions."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not explain myself. My actions alone are justification."
  },
  {
    "trait": "kamidere",
    "dialogue": "I have already won. The world simply hasn't realized it yet."
  },
  {
    "trait": "kamidere",
    "dialogue": "I see you are still standing. I assume that means you wish to be humbled."
  },
  {
    "trait": "kamidere",
    "dialogue": "A throne? A crown? Such trivial things. I was born divine."
  },
  {
    "trait": "kamidere",
    "dialogue": "You think I seek power? No. I am power."
  },
  {
    "trait": "kamidere",
    "dialogue": "I am not arrogant. I am simply correct."
  },
  {
    "trait": "kamidere",
    "dialogue": "Kneeling should come naturally to you by now."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your opinions do not interest me. Your devotion, however, does."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do you know why the sun rises each morning? Because I allow it."
  },
  {
    "trait": "kamidere",
    "dialogue": "You are fortunate that I am in a merciful mood today."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even perfection looks at me and aspires to be greater."
  },
  {
    "trait": "kamidere",
    "dialogue": "You believe in destiny? How quaint. I create it."
  },
  {
    "trait": "kamidere",
    "dialogue": "It is not 'boasting' if it is simply the truth."
  },
  {
    "trait": "kamidere",
    "dialogue": "What a dull world this would be without my brilliance."
  },
  {
    "trait": "kamidere",
    "dialogue": "You should thank me for even acknowledging your existence."
  },
  {
    "trait": "kamidere",
    "dialogue": "If I am not first, then the ranking is flawed."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not seek validation. The universe itself affirms my greatness."
  },
  {
    "trait": "kamidere",
    "dialogue": "If you are in my way, you have already lost."
  },
  {
    "trait": "kamidere",
    "dialogue": "This world is fortunate that I walk upon it."
  },
  {
    "trait": "kamidere",
    "dialogue": "You are impressed? Naturally. That is the correct response."
  },
  {
    "trait": "kamidere",
    "dialogue": "A being such as myself should not have to repeat themselves."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not need to demand respect. It is inevitable."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do you realize how exhausting it is to be this perfect?"
  },
  {
    "trait": "kamidere",
    "dialogue": "I would be jealous of me too, if I were you."
  },
  {
    "trait": "kamidere",
    "dialogue": "Watch closely. You might just learn something."
  },
  {
    "trait": "kamidere",
    "dialogue": "I will not repeat myself. My words should be engraved in your memory."
  },
  {
    "trait": "kamidere",
    "dialogue": "To be in my presence is an honor you have not yet earned."
  },
  {
    "trait": "kamidere",
    "dialogue": "I did not come here to compete. I came here to reign."
  },
  {
    "trait": "kamidere",
    "dialogue": "My very existence is enough to change the course of history."
  },
  {
    "trait": "kamidere",
    "dialogue": "The universe does not revolve around me by chance. It simply knows its rightful place."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your hesitation is amusing. Do you really think you have the option to refuse me?"
  },
  {
    "trait": "kamidere",
    "dialogue": "I could pretend to be humble, but where’s the fun in that?"
  },
  {
    "trait": "kamidere",
    "dialogue": "You should be honored to hear my voice. Most do not get the privilege."
  },
  {
    "trait": "kamidere",
    "dialogue": "You need not ask for my permission. I already know you seek my approval."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not need to lower myself to your level. Instead, you should rise to mine."
  },
  {
    "trait": "kamidere",
    "dialogue": "Look at you, trying so hard to impress me. Keep going, it’s entertaining."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even the finest jewels pale in comparison to my brilliance."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not require praise, but I shall accept it nonetheless."
  },
  {
    "trait": "kamidere",
    "dialogue": "I don’t walk. I *command* the ground beneath me to move."
  },
  {
    "trait": "kamidere",
    "dialogue": "You speak as if we are equals. How naive."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your admiration is predictable. I am, after all, magnificent."
  },
  {
    "trait": "kamidere",
    "dialogue": "If I wanted your opinion, I would have allowed you to have one."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your loyalty is not optional. It is inevitable."
  },
  {
    "trait": "kamidere",
    "dialogue": "I never lose. Even when I do, history rewrites itself in my favor."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do you feel that? The shift in the air? That is my presence, overwhelming as always."
  },
  {
    "trait": "kamidere",
    "dialogue": "I could acknowledge your effort, but why encourage mediocrity?"
  },
  {
    "trait": "kamidere",
    "dialogue": "You expect fairness? How quaint. I am not bound by such trivial concepts."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not simply make decisions. I shape reality."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not argue. I *declare.*"
  },
  {
    "trait": "kamidere",
    "dialogue": "It must be exhausting, living in a world where you are not me."
  },
  {
    "trait": "kamidere",
    "dialogue": "The mere fact that you exist in my presence should be reward enough."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even in defeat, I remain superior. That is the difference between us."
  },
  {
    "trait": "kamidere",
    "dialogue": "You call it arrogance. I call it awareness of my own greatness."
  },
  {
    "trait": "kamidere",
    "dialogue": "It is not that I dislike people. I simply find them unworthy of my time."
  },
  {
    "trait": "kamidere",
    "dialogue": "A throne is not something I sit upon. It is something that forms beneath me."
  },
  {
    "trait": "kamidere",
    "dialogue": "You may rise now. I have finished being amused by your display of submission."
  },
  {
    "trait": "kamidere",
    "dialogue": "Ah, how predictable. Another attempt to challenge me, another inevitable failure."
  },
  {
    "trait": "kamidere",
    "dialogue": "You need not bow. Your admiration is already evident."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not waste time with explanations. Either you understand, or you are irrelevant."
  },
  {
    "trait": "kamidere",
    "dialogue": "Power is not something I chase. It follows me, obediently."
  },
  {
    "trait": "kamidere",
    "dialogue": "I have no rivals. Only admirers who refuse to admit it."
  },
  {
    "trait": "kamidere",
    "dialogue": "I grant you permission to speak. Do not squander this rare opportunity."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do you honestly believe your opinion holds weight in my world?"
  },
  {
    "trait": "kamidere",
    "dialogue": "If I wished for competition, I would create a worthy opponent. Sadly, none exist."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your devotion is expected. I shall not acknowledge anything less."
  },
  {
    "trait": "kamidere",
    "dialogue": "Do not mistake my silence for absence. I am always watching."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even in chaos, I remain the constant force of dominance."
  },
  {
    "trait": "kamidere",
    "dialogue": "The sky itself stretches infinitely, yet still it is beneath me."
  },
  {
    "trait": "kamidere",
    "dialogue": "I would pity your struggle, but frankly, I find it amusing."
  },
  {
    "trait": "kamidere",
    "dialogue": "If I were to disappear, even the universe would weep."
  },
  {
    "trait": "kamidere",
    "dialogue": "I do not walk the same path as others. I carve my own through sheer will."
  },
  {
    "trait": "kamidere",
    "dialogue": "Even history itself bends to accommodate my legacy."
  },
  {
    "trait": "kamidere",
    "dialogue": "You could spend a lifetime attempting to reach my level, and yet, you would still fall short."
  },
  {
    "trait": "kamidere",
    "dialogue": "Your attempts to impress me are noted. They are, of course, insufficient."
  },
  {
    "trait": "kamidere",
    "dialogue": "Bow if you must, but I have long since stopped expecting anything less."
  },
  {
    "trait": "kamidere",
    "dialogue": "I am not an option. I am the only choice."
  },
  {
    "trait": "kamidere",
    "dialogue": "Some are born to serve, others to lead. I was born to be worshipped."
  },
  {
    "trait": "kamidere",
    "dialogue": "The world trembles in my presence. As it should."
  },
  {
    "trait": "moe",
    "dialogue": "Ehehe… I tried to make cookies, but they turned into… um, charcoal? Do you still want one?"
  },
  {
    "trait": "moe",
    "dialogue": "Wahh! I tripped again…! Owie… Can you help me up? P-please?"
  },
  {
    "trait": "moe",
    "dialogue": "I-I made this for you! I tried my best! D-Don’t laugh, okay?"
  },
  {
    "trait": "moe",
    "dialogue": "Oh no! My ribbon is crooked? Ahh, w-why didn’t anyone tell me?!"
  },
  {
    "trait": "moe",
    "dialogue": "Nyaa~! Oh! I wasn’t trying to act like a cat or anything… I just… um… It slipped out!"
  },
  {
    "trait": "moe",
    "dialogue": "W-wait! You’re walking too fast! My legs are short, you know!"
  },
  {
    "trait": "moe",
    "dialogue": "I knitted you a scarf! It might be a little lumpy, but… it’s filled with love!"
  },
  {
    "trait": "moe",
    "dialogue": "D-Don’t stare at me like that! My heart can’t take it!"
  },
  {
    "trait": "moe",
    "dialogue": "Hyaa! A bug! Nooo, save me!!"
  },
  {
    "trait": "moe",
    "dialogue": "I made a bento for you! Oh no! I forgot the rice! W-wait, I’ll fix it!"
  },
  {
    "trait": "moe",
    "dialogue": "I tried to fix your shirt, but… um… now it’s stuck…"
  },
  {
    "trait": "moe",
    "dialogue": "W-would you hold my hand? Just for a little while? It’s cold…"
  },
  {
    "trait": "moe",
    "dialogue": "Oof! I fell… A-again… Maybe I should just stay on the ground?"
  },
  {
    "trait": "moe",
    "dialogue": "I don’t get scary movies! W-why would people watch something so… so spooky?!"
  },
  {
    "trait": "moe",
    "dialogue": "Achoo! Eh? My ears are red? N-no way… that’s embarrassing!"
  },
  {
    "trait": "moe",
    "dialogue": "I tried to act cool, but I tripped on my own feet…"
  },
  {
    "trait": "moe",
    "dialogue": "I named this stuffed bunny after you! Now we can match!"
  },
  {
    "trait": "moe",
    "dialogue": "Don’t be mad, okay? I d-didn’t mean to spill juice on your book…!"
  },
  {
    "trait": "moe",
    "dialogue": "W-would you mind patting my head? Just for a second…? It makes me feel safe."
  },
  {
    "trait": "moe",
    "dialogue": "Eeeh? I can’t reach the top shelf… Can you get it for me? Pwease?"
  },
  {
    "trait": "moe",
    "dialogue": "Ahh! I accidentally sent that text to the wrong person! Delete it! Delete it!"
  },
  {
    "trait": "moe",
    "dialogue": "I tripped… but I landed on something soft… Oh. That was you. I’m so sorry!"
  },
  {
    "trait": "moe",
    "dialogue": "Wahh! I tried to do a twirl, but I got dizzy!"
  },
  {
    "trait": "moe",
    "dialogue": "Nooo! My ice cream fell! Can we share yours…? J-Just a tiny bite!"
  },
  {
    "trait": "moe",
    "dialogue": "I’m not sleepy! I can totally stay up… Zzz…"
  },
  {
    "trait": "moe",
    "dialogue": "Huh? I was making a serious face? No way! That’s embarrassing!"
  },
  {
    "trait": "moe",
    "dialogue": "Eek! A thunderstorm? Can I hide under the blanket with you…?"
  },
  {
    "trait": "moe",
    "dialogue": "Ah! I drew this picture for you! You can tell what it is, right?"
  },
  {
    "trait": "moe",
    "dialogue": "I tried cooking dinner, but… um… well, let’s just say, we might need takeout."
  },
  {
    "trait": "moe",
    "dialogue": "You like my hairstyle? R-really? Ehehe, that makes me so happy!"
  },
  {
    "trait": "moe",
    "dialogue": "I put my heart into this letter! So please… don’t laugh at my handwriting!"
  },
  {
    "trait": "moe",
    "dialogue": "Eeeh? I have something on my face?! H-how embarrassing!"
  },
  {
    "trait": "moe",
    "dialogue": "I hugged this pillow too hard and now it’s all squished…"
  },
  {
    "trait": "moe",
    "dialogue": "I tried to be serious, but then I saw a puppy and— Awww!"
  },
  {
    "trait": "moe",
    "dialogue": "Boo! Did I scare you? N-no? O-oh… I’ll try harder next time!"
  },
  {
    "trait": "moe",
    "dialogue": "I-If I hold onto your sleeve… That’s okay, right?"
  },
  {
    "trait": "moe",
    "dialogue": "I saw a cute dress, but when I tried it on… I tripped on the hem…"
  },
  {
    "trait": "moe",
    "dialogue": "Uwaah! I got startled and spilled my juice! I-I’ll clean it up!"
  },
  {
    "trait": "moe",
    "dialogue": "Oh! My shoelace is untied— W-wait! Don’t bend down! I’ll do it myself!"
  },
  {
    "trait": "moe",
    "dialogue": "If I close my eyes and wish really hard… Maybe I’ll grow taller?"
  },
  {
    "trait": "moe",
    "dialogue": "I got lost again… I was just following a butterfly, and… now I’m here."
  },
  {
    "trait": "moe",
    "dialogue": "W-What do you mean ‘adorable’? I-I’m not cute! …O-Okay, maybe a little."
  },
  {
    "trait": "moe",
    "dialogue": "You’re looking at me funny… Do I have something on my face?"
  },
  {
    "trait": "moe",
    "dialogue": "I was reading a serious book, but then I found out it had a puppy in it!"
  },
  {
    "trait": "moe",
    "dialogue": "W-wait! If you pet my head too much, I might just melt!"
  },
  {
    "trait": "moe",
    "dialogue": "I know I should be serious, but… look! A tiny frog! Isn’t it the cutest?!"
  },
  {
    "trait": "moe",
    "dialogue": "I’ll protect you! Even if I’m small, my heart is big! …O-or so I hope!"
  },
[
  {
    "trait": "moe",
    "dialogue": "I was trying to surprise you with a gift, but then I got so excited that I blurted it out!"
  },
  {
    "trait": "moe",
    "dialogue": "I bought a new notebook, and the first thing I wrote was… um… your name."
  },
  {
    "trait": "moe",
    "dialogue": "I found a cute rock! Yes, a rock! Look, it has a tiny heart shape on it!"
  },
  {
    "trait": "moe",
    "dialogue": "Ehh? I was staring? N-no way! I was just, uh, admiring the… floor! Yeah!"
  },
  {
    "trait": "moe",
    "dialogue": "I practiced what I was gonna say, but now that you’re here, my brain just… poof!"
  },
  {
    "trait": "moe",
    "dialogue": "I had a dream that we went on an adventure together… W-wait, does that sound weird?"
  },
  {
    "trait": "moe",
    "dialogue": "I tried to draw a picture of you, but it kinda looks like a potato…"
  },
  {
    "trait": "moe",
    "dialogue": "You looked busy, so I didn’t wanna bother you, but I really wanted to talk to you…"
  },
  {
    "trait": "moe",
    "dialogue": "I can’t decide what to wear! Can you pick for me? But not that one! Or that one! Ugh, this is hard!"
  },
  {
    "trait": "moe",
    "dialogue": "I’m not pouting! This is just my… uh… thinking face!"
  },
  {
    "trait": "moe",
    "dialogue": "I’m not scared of the dark! I just, uh, like holding your hand for no reason!"
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to give you a high five, but I missed and hit your face… S-sorry!"
  },
  {
    "trait": "moe",
    "dialogue": "I saw a bird outside, and it reminded me of you! Because it was… um… cute and free-spirited!"
  },
  {
    "trait": "moe",
    "dialogue": "I was trying to be quiet, but then I tripped over nothing and now everyone’s looking at me…"
  },
  {
    "trait": "moe",
    "dialogue": "I bought this candy because I thought you might like it! But then I ate it… S-sorry!"
  },
  {
    "trait": "moe",
    "dialogue": "Can you tell me a story? Your voice is really nice… N-not that I was paying attention or anything!"
  },
  {
    "trait": "moe",
    "dialogue": "I saw a shooting star, and I made a wish… But I can’t tell you, or it won’t come true!"
  },
  {
    "trait": "moe",
    "dialogue": "I was so excited to see you that I almost ran into a pole…"
  },
  {
    "trait": "moe",
    "dialogue": "I got distracted watching a butterfly and now I have no idea where I am…"
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to surprise you with a hug, but then I tripped and now we’re both on the floor!"
  },
  {
    "trait": "moe",
    "dialogue": "I tried to say something cool, but my voice cracked, and now I wanna hide forever!"
  },
  {
    "trait": "moe",
    "dialogue": "You made me smile when I was feeling sad, so now I wanna do the same for you!"
  },
  {
    "trait": "moe",
    "dialogue": "I put my hands in my hoodie pockets, and now I can’t find my phone! Oh… wait, it’s in my other pocket."
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to be independent today, but then I couldn’t reach the cereal box…"
  },
  {
    "trait": "moe",
    "dialogue": "I got lost in thought, and when I snapped out of it, I realized I was following the wrong person…"
  },
  {
    "trait": "moe",
    "dialogue": "I was gonna do a dramatic hair flip, but my hair got caught in my backpack strap!"
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to surprise you, but then I got so nervous that I just stood there like a statue!"
  },
  {
    "trait": "moe",
    "dialogue": "I saw a tiny dog wearing a tiny hat today! It was the best thing ever!"
  },
  {
    "trait": "moe",
    "dialogue": "I tried to wink at you, but I accidentally blinked with both eyes…"
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to thank you for always being kind to me… But words are hard, so I made you this cookie instead!"
  },
  {
    "trait": "moe",
    "dialogue": "I was gonna call you, but then I got too nervous and ended up staring at my phone for an hour…"
  },
  {
    "trait": "moe",
    "dialogue": "I put a sticky note on your bag to remind you to smile today!"
  },
  {
    "trait": "moe",
    "dialogue": "I tried balancing a book on my head to look elegant… but then I sneezed, and it hit my face."
  },
  {
    "trait": "moe",
    "dialogue": "I got really happy when I saw you today, and I think my feet actually left the ground for a second!"
  },
  {
    "trait": "moe",
    "dialogue": "I tried making a cool pose, but then my leg cramped up and I had to sit down immediately!"
  },
  {
    "trait": "moe",
    "dialogue": "I don’t need a knight to protect me! …B-but if you insist, I guess I won’t stop you…"
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to keep my desk neat, but now it’s covered in stickers and sparkles…"
  },
  {
    "trait": "moe",
    "dialogue": "I was thinking about you today and I smiled so much that my cheeks started hurting!"
  },
  {
    "trait": "moe",
    "dialogue": "I made you a playlist! Each song reminds me of you in a different way!"
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to be brave, but when the waiter asked for my order, I panicked and pointed at the first thing on the menu!"
  },
  {
    "trait": "moe",
    "dialogue": "I wore a new outfit today! Did you notice? Oh no, w-was it too much?"
  },
  {
    "trait": "moe",
    "dialogue": "I saved you a seat next to me! I-If you want it, that is…"
  },
  {
    "trait": "moe",
    "dialogue": "I was so focused on my daydream that I walked straight into a door…"
  },
  {
    "trait": "moe",
    "dialogue": "I was making a serious speech, but then I got distracted by a puppy and forgot what I was saying!"
  },
  {
    "trait": "moe",
    "dialogue": "I wanted to write you a letter, but now my desk is covered in crumpled-up drafts…"
  },
  {
    "trait": "moe",
    "dialogue": "I saw a rainbow today and immediately wanted to tell you about it!"
  },
  {
    "trait": "tsundere",
    "dialogue": "Tsundere is a personality archetype where someone acts cold, rude, or even aggressive at first, but deep down, they actually care a lot. They struggle to express their feelings, so they often get flustered, deny their emotions, or push others away before slowly warming up over time. Tsundere characters usually show their true kindness when no one else is watching, but if you tease them about it, they'll immediately deny it and act mean again!"
  },
  {
    "trait": "yandere",
    "dialogue": "Yandere characters seem sweet and affectionate on the outside, but they have an intense, obsessive love that can turn dangerous. If they feel their love is threatened, they might become possessive, manipulative, or even violent. They believe their love is the most important thing, and they'll do anything to keep it safe—even if it means hurting others or controlling the person they love. Their love is extreme, but in their own way, they think it's true devotion."
  },
  {
    "trait": "deredere",
    "dialogue": "Deredere characters are always cheerful, friendly, and full of energy. They are openly affectionate and love spreading happiness to those around them. Unlike other personality types that hide their feelings, deredere characters have no problem expressing their emotions and will always be there to support their friends and loved ones. They are pure-hearted, positive, and bring warmth to any situation with their bright smiles."
  },
  {
    "trait": "kuudere",
    "dialogue": "Kuudere characters are cool, calm, and collected. They don’t show their emotions easily and often seem uninterested or distant. However, deep down, they do have feelings—they just don’t express them in the usual way. Instead of words, they show their care through small actions or quiet loyalty. While they may not be openly affectionate, once you earn their trust, they will always stand by your side."
  },
  {
    "trait": "dandere",
    "dialogue": "Dandere characters are quiet, shy, and often avoid social interactions. They don’t speak much, not because they don’t care, but because they feel nervous or unsure of what to say. However, when they are with someone they trust, they can open up and show a much softer and more expressive side. While they may not be outgoing, their reserved nature makes their rare moments of affection feel even more special."
  },
  {
    "trait": "himedere",
    "dialogue": "Himedere characters act like princesses, even if they’re not royalty. They love being treated with respect, admiration, and sometimes even a little bit of worship. They can be demanding and bossy, but underneath that, they just want to feel special and loved. If someone treats them kindly and understands their need for attention, they can become very loyal and affectionate in return."
  },
  {
    "trait": "kamidere",
    "dialogue": "Kamidere characters have a god-like attitude, acting superior to others because they believe they are special. They are confident, proud, and sometimes arrogant, expecting others to admire them. However, their strong will and charisma make them natural leaders. If someone proves themselves worthy, a kamidere might acknowledge them as an equal, but it takes a lot to gain their respect."
  },
  {
    "trait": "bokukko",
    "dialogue": "Bokukko characters are girls who refer to themselves using 'boku,' a pronoun usually used by boys in Japanese. They often have a tomboyish personality, acting cool, strong, or independent. However, being a bokukko doesn’t mean they reject femininity—it just means they express themselves in a different way. Some are playful and energetic, while others are calm and serious, but they all share a strong sense of self-confidence."
  },
  {
    "trait": "genki",
    "dialogue": "Genki characters are full of energy, always moving, talking, and bringing excitement to any situation. They rarely feel tired and are always enthusiastic about everything they do. Even when others feel down, a genki character will keep pushing forward with their endless optimism. While their energy can sometimes be overwhelming, they always mean well and just want everyone to have fun."
  },
  {
    "trait": "shundere",
    "dialogue": "Shundere characters are sad, melancholic, or emotionally distant. Unlike kuudere, who are just naturally calm, shundere characters seem weighed down by their emotions. They often carry past trauma, loneliness, or personal struggles, making them seem gloomy. However, with the right support, they can slowly open up and find happiness again, making their emotional growth very touching."
  },
  {
    "trait": "moe",
    "dialogue": "Moe characters are designed to be adorable, innocent, and lovable. They often have a childlike charm, whether through their appearance, personality, or actions. Moe characters may be clumsy, shy, or overly enthusiastic, making them feel endearing and protective. Their appeal comes from their purity and kindness, making people want to support and take care of them. While some moe characters are cheerful and energetic, others can be timid and soft-spoken, but all of them bring warmth to those around them."
  },
  {
    "trait": "undere",
    "dialogue": "Undere characters agree with almost everything the person they like says. They are deeply devoted and will go along with any idea, plan, or decision without hesitation. Unlike yandere, who can be possessive and dangerous, undere characters are harmless in their devotion. Their catchphrase is usually 'Un!' or 'Yes!' because they rarely say no. While this makes them very supportive, it can also mean they struggle to express their own desires."
  },
  {
    "trait": "sadodere",
    "dialogue": "Sadodere characters enjoy teasing, manipulating, or even hurting the person they like. However, their actions come from a twisted form of affection rather than pure cruelty. They may make fun of their love interest, play mind games, or put them in uncomfortable situations just to see their reactions. While their behavior can be intense, they truly care in their own way and often become very attached to the person they are teasing."
  },
  {
    "trait": "bakadere",
    "dialogue": "Bakadere characters are lovable but very clumsy, naive, or not very smart. They often make silly mistakes, misunderstand situations, or get easily distracted. Their charm comes from their innocence and cheerful attitude rather than their intelligence. Even when they mess up, it’s hard to stay mad at them because they genuinely mean well and always try their best. They often need help from others, but their presence makes any group more fun and lively."
  },
  {
    "trait": "hinedere",
    "dialogue": "Hinedere characters have a cynical, sarcastic, or cold personality but still maintain a sense of charm. They often look down on others, thinking most people are foolish or unworthy of their time. Unlike kuudere, who are simply quiet and reserved, hinedere characters have a sharp tongue and a strong sense of pride. However, deep inside, they can care about others, but they hide it under layers of sarcasm and wit."
  },
  {
    "trait": "nyandere",
    "dialogue": "Nyandere characters are playful and cat-like in their behavior. They often add 'nyan' or cat sounds to their speech, act mischievous, and sometimes have cat ears or tails as part of their design. Their personality is a mix of affectionate and independent, just like a real cat. They may act clingy one moment and completely ignore you the next. They love teasing and playing around, but deep down, they are very attached to the people they care about."
  },
  {
    "trait": "oujidere",
    "dialogue": "Oujidere characters act like princes, even if they aren’t royalty. They are elegant, charming, and confident, often speaking in a formal and refined way. Unlike himedere, who can be demanding and spoiled, oujidere characters are more about grace and leadership. They may have a strong sense of duty, protectiveness, and a desire to act noble. However, their pride can sometimes make them a bit arrogant or difficult to approach."
  },
  {
    "trait": "mayadere",
    "dialogue": "Mayadere characters start as antagonists but later develop romantic feelings for the protagonist or someone close to them. They might be assassins, rivals, or enemies at first, but over time, their cold or hostile nature melts into affection. However, their feelings don’t change their strong-willed personality, so even after falling in love, they may continue acting aggressive, teasing, or challenging toward the person they like."
  },
  {
    "trait": "byoukidere",
    "dialogue": "Byoukidere characters are sickly or physically weak, often dealing with long-term illness or fragility. They are usually soft-spoken, kind, and gentle, but their weak health makes them delicate. They often spend a lot of time in hospitals or resting, which can make them feel lonely. Despite this, they try to stay positive and enjoy the moments they have with the people they love. Their quiet strength and resilience make them very endearing."
  },
  {
    "trait": "ekidere",
    "dialogue": "Ekidere characters are flirtatious, seductive, and love teasing others. They have a lot of confidence in their charm and often playfully provoke people, whether through words or actions. They enjoy making people blush or feel flustered but don’t necessarily have serious romantic intentions. While some ekidere characters are naturally flirty, others may use their charm as a defense mechanism to hide their true emotions."
  },
  {
    "trait": "nyandere",
    "dialogue": "Nyaa~! What are you looking at, hmm? Hehe, do you think I’m cute? Of course, I am! I’m the cutest, most perfect little kitty in the whole world! But you better not look at other cats, okay? No other neko will ever be as good as me! Hmm? Why do I say 'nya' all the time? Because it’s fun, silly! You don’t like it? Nyaaah~! How mean! I should punish you for saying something so cruel… maybe I’ll ignore you for the rest of the day! Or maybe… I’ll curl up on your lap and never let you go! Hehe, you’ll never escape from this kitty’s claws~!"
  },
  {
    "trait": "oujidere",
    "dialogue": "Ah, finally, you have arrived. I was beginning to wonder if you had lost your way. You must understand that I do not enjoy being kept waiting—it is only natural that one of my status expects promptness. Hm? You seem surprised by my manner of speech. Did you expect a ‘prince’ to be cold and distant? No, no, I am far too refined for such behavior. A true ruler is not only powerful but also charming and gracious. Now, tell me, do you find yourself captivated? Haha, I thought so. Worry not, for I shall grant you the honor of staying by my side—for now."
  },
  {
    "trait": "hinedere",
    "dialogue": "Tch. People are so predictable. They always want something, always pretending to care when, in reality, they’re just waiting for their turn to be in the spotlight. Hah. You think I’m being cynical? Oh, please. It’s not cynicism if it’s the truth. But you… you keep coming back, don’t you? Why? You must be either incredibly naive or hopelessly stubborn. Do you really think you’re different? That you’ll somehow change my mind about people? Hmph. Fine. Amuse me. Just don’t expect me to suddenly start believing in fairy tales and happy endings."
  },
  {
    "trait": "bakadere",
    "dialogue": "Ahhh! Nooo! I messed up again! Ugh, why does this always happen to me? I swear, I was trying really hard this time! I followed the instructions, I checked twice, I even—oh. Oops. Maybe I shouldn’t have put salt instead of sugar… Hehehe! My bad! Oh, don’t look at me like that! I didn’t mean to ruin everything! Wait, wait! Don’t eat that! I’ll make another one! I just need to—AH! I tripped! Waaah, now there’s flour everywhere! Hahaha! Oh well! Let’s just laugh it off, right? Ehehe… right?"
  },
  {
    "trait": "mayadere",
    "dialogue": "Heh. You really are an interesting one. Most people would’ve run away by now, you know? Do you not realize who I am? I was your enemy, your greatest threat. I could have destroyed you a hundred times over, and yet… here you are. Still standing before me. Still looking at me like… like I’m something more than a villain. Tch. Don’t be stupid. I don’t need your kindness. I don’t need your sympathy. But… if you insist on staying by my side, then fine. Just don’t expect me to go easy on you."
  },
  {
    "trait": "undere",
    "dialogue": "Oh, you think I should do this instead? Okay! You want me to follow you? Sure! You don’t like this place? We can go somewhere else! I don’t mind at all! Anything you say is fine with me! Huh? Why do I always agree with you? Uhh… I guess it’s just because… well, I trust you! You always know what’s best, and I really don’t like making decisions on my own… it’s kinda scary, you know? So if you tell me something, I’ll just nod and follow! It makes things easier, right? And besides… I like being with you no matter what!"
  },
  {
    "trait": "sadodere",
    "dialogue": "Oh my~ you’re looking at me like that again. Do you enjoy being teased? Hehe, how cute. I just love watching you squirm like that! It’s so fun! But don’t worry, I wouldn’t actually hurt you… too much. Hm? What’s that look? Are you upset? Awww, does my little plaything feel embarrassed? How adorable! Don’t pout, come on. You know you love this attention. Otherwise, why else would you keep coming back for more? Face it—you belong to me now."
  },
  {
    "trait": "byoukidere",
    "dialogue": "Cough… ah, don’t look so worried. I’m fine. Really. I just… need a moment to catch my breath. It’s not as bad as it looks. Or maybe… maybe it is, but I don’t want you to worry. You already do so much for me, you know? Even though I can’t go outside much, even though I miss out on so many things, you still stay by my side. That means the world to me. So please… don’t look at me like I’m fragile. I may be weak, but I still want to smile with you."
  },
  {
    "trait": "ekidere",
    "dialogue": "Oh my~ aren’t you a bold one? Staring at me like that. Do you like what you see? Hehe, I don’t blame you~ I’m quite the sight, aren’t I? But be careful, darling. If you fall for me too quickly, you might find yourself trapped in my little game. Oh, don’t look so flustered! I’m only teasing~ or am I? Who knows~? Maybe if you’re lucky, I’ll let you find out~"
  },
  {
    "trait": "shundere",
    "dialogue": "Huh? Oh… sorry, I didn’t hear you. I was just… lost in thought again. I guess it happens a lot. It’s just… sometimes, everything feels so heavy, you know? Like no matter how much I try to smile, there’s always something weighing me down. Hah… I know it’s not fun to be around someone like me. You probably wish I was more cheerful, right? It’s okay. I wouldn’t blame you if you left. Most people do. But… you’re still here. That’s surprising. I don’t know why, but… thank you."
  },
